{"artists": [{"name": "Ed Sheeran", "img": "https://lastfm-img2.akamaized.net/i/u/64s/fa36962445080a3357cd1585fd2cb474.png", "play_count": "74978694", "tracks": [{"album": "+", "play_count": "5084291", "name": "The A Team", "img": "https://lastfm-img2.akamaized.net/i/u/174s/fa36962445080a3357cd1585fd2cb474.png", "tags": ["acoustic", "pop", "british", "sad", "chillout"], "lyrics": "White lips, pale face, breathing in snowflakes\nBurnt lungs, sour taste\nLight's gone, day's end, struggling to pay rent\nLong nights, strange men\n\nAnd they say she's in the Class A Team\nStuck in her daydream, been this way since 18\nBut lately her face seems slowly sinking, wasting\nCrumbling like pastries, they scream\nThe worst things in life come free to us\n\n'Cause we're just under the upperhand\nAnd go mad for a couple grams\nAnd she don't want to go outside tonight\n\nAnd in a pipe she flies to the motherland\nOr sells love to another man\nIt's too cold outside for angels to fly\nAngels to fly\n\nRipped gloves, raincoat, tried to swim, stay afloat\nDry house, wet clothes\nLoose change, bank notes, weary-eyed, dry throat\nCall girl, no phone\n\nAnd they say she's in the Class A Team\nStuck in her daydream, been this way since 18\nBut lately her face seems slowly sinking, wasting\nCrumbling like pastries, they scream\nThe worst things in life come free to us\n\n'Cause we're just under the upperhand\nAnd go mad for a couple grams\nBut she don't want to go outside tonight\n\nAnd in a pipe she flies to the motherland\nSells love to another man\nIt's too cold outside for angels to fly\n\nAn angel will die, covered in white\nClosed eye and hoping for a better life\nThis time, we'll fade out tonight\nStraight down the line\n\nAnd they say she's in the Class A Team\nStuck in her daydream, been this way since 18\nBut lately her face seems slowly sinking, wasting\nCrumbling like pastries, they scream\nThe worst things in life come free to us\n\nAnd we're all under the upper hand\nGo mad for a couple grams\nAnd we don't want to go outside tonight\n\nIn a pipe, fly to the motherland\nOr sell love to another man\nIt's too cold outside for angels to fly\nAngels to fly\n\nTo fly, fly\nFor angels to fly\nTo fly, to fly\nAngels to die", "youtube": {"duration": 290, "date_published": "2010-04-22 20:28:09", "video_id": "UAWcs5H-qgQ", "description": "Official music video for Ed Sheeran's 'The A Team'. Listen to the remix EP here: http://bit.ly/ATeamEP Subscribe to Ed's channel: http://bit.ly/SubscribeToEdSheeran Watch all of Ed's official..."}, "description": "The A Team Songfacts explains the song is a true story and was written by Sheeran after meeting a homeless prostitute called Angel, whilst volunteering at a Crisis homeless shelter. The song became the highest selling debut single on the UK singles charts in the first half of 2011.\n\n'The A Team' was the debut single release from twenty-year-old singer/songwriter Ed Sheeran and is a story about a girl he met whilst volunteering at a homeless shelter – it soared into the top three on its release in June 2011. <a href=\"http://www.last.fm/music/Ed+Sheeran/_/The+A+Team\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}, {"album": "x", "play_count": "4539174", "name": "Thinking Out Loud", "img": "https://lastfm-img2.akamaized.net/i/u/174s/fa36962445080a3357cd1585fd2cb474.png", "tags": ["soul", "Love", "lovesong", "10s", "middle"], "lyrics": "When your legs don't work like they used to before\nAnd I can't sweep you off of your feet\nWill your mouth still remember the taste of my love?\nWill your eyes still smile from your cheeks?\n\nAnd darling, I will be loving you till we're seventy\nAnd baby, my heart could still fall as hard at twenty-three\nAnd I'm thinking 'bout how\nPeople fall in love in mysterious ways\nMaybe just the touch of a hand\nOh, me, I fall in love with you every single day\nAnd I just wanna tell you I am\n\nSo honey, now\nTake me into your loving arms\nKiss me under the light of a thousand stars\nPlace your head on my beating heart\nI'm thinking out loud\nMaybe we found love right where we are\n\nWhen my hair's all but gone and my memory fades\nAnd the crowds don't remember my name\nWhen my hands don't play the strings the same way\nI know you will still love me the same\n\n'Cause honey, your soul\nIt could never grow old, it's evergreen\nAnd baby, your smile's forever in my mind and memory\nAnd I'm thinking 'bout how\nPeople fall in love in mysterious ways\nAnd maybe it's all part of a plan\nWell, I'll just keep on making the same mistakes\nHoping that you'll understand\n\nBut baby, now\nTake me into your loving arms\nKiss me under the light of a thousand stars\nPlace your head on my beating heart\nI'm thinking out loud\nThat maybe we found love right where we are\n\nSo baby, now\nTake me into your loving arms\nKiss me under the light of a thousand stars\nOh darling, place your head on my beating heart\nI'm thinking out loud\nThat maybe we found love right where we are\nOh, maybe we found love right where we are\nAnd we found love right where we are", "youtube": {"duration": 297, "date_published": "2014-10-07 13:57:37", "video_id": "lp-EO5I60KA", "description": "The official video for 'Thinking Out Loud', Ed learnt to dance! 'x', available to buy via iTunes here: http://smarturl.it/x-itunesdlx Featuring and taught by @dance10Brittany and @dance10Paul..."}, "description": null}, {"album": "x", "play_count": "3920075", "name": "I See Fire", "img": "https://lastfm-img2.akamaized.net/i/u/174s/fa36962445080a3357cd1585fd2cb474.png", "tags": ["Soundtrack", "folk", "Ed Sheeran", "indie", "male vocalists"], "lyrics": "Oh misty eye of the mountain below\nKeep careful watch of my brothers' souls\nAnd should the sky be filled with fire and smoke\nKeep watching over Durin's sons\n\nIf this is to end in fire then we shall all burn together\nWatch the flames climb high into the night\nCalling out father oh, stand by and we will\nWatch the flames burn auburn on the mountainside\n\nAnd if we should die tonight, we should all die together\nRaise a glass of wine for the last time\nCalling out father oh, prepare as we will\nWatch the flames burn auburn on the mountainside\nDesolation comes upon the sky\n\nNow I see fire\nInside the mountain, I see fire\nBurning the trees\nAnd I see fire\nHollowing soul\nI see fire\nBlood in the breeze\nAnd I hope that you remember me\n\nOh should my people fall then surely I'll do the same\nConfined in mountain halls, we got too close to the flame\nCalling out father oh, hold fast and we will\nWatch the flames burn auburn on the mountainside\nDesolation comes upon the sky\n\nNow I see fire\nInside the mountain\nI see fire\nBurning the trees\nAnd I see fire\nHollowing soul\nI see fire\nBlood in the breeze\nAnd I hope that you remember me\n\nAnd if the night is burning I will cover my eyes\nFor if the dark returns then my brothers will die\nAnd as this sky is falling down, it crashed into this lonely town\nAnd with that shadow upon the ground I hear my people screaming out\n\nAnd I see fire\nInside the mountains\nI see fire\nBurning the trees\nI see fire\nHollowing souls\nI see fire\nBlood in the breeze\n\nI see fire\nOh you know I saw a city burning (Fire)\nAnd I see fire\nFeel the heat upon my skin (Fire)\nAnd I see fire\nOh (Fire)\nAnd I see fire burn auburn on the mountainside", "youtube": {"duration": 295, "date_published": "2013-11-27 16:23:36", "video_id": "2fngvQS_PmQ", "description": "Music video for \"I See Fire\" Performed by Ed Sheeran Buy on iTunes: http://smarturl.it/smaugi See The Hobbit: The Desolation of Smaug in theaters December 13, 2013. Edited by CLS Videos Twitter:..."}, "description": "\"I See Fire\" is a song from The Hobbit: The Desolation of Smaug, written, composed and performed by English singer-songwriter Ed Sheeran. It appears as the end-credit song for the film. It entered the UK Singles Chart at number 13 and reached number 1 in New Zealand on its sixth week, marking Sheeran's first number-one single in the country.\n\nChosen by The Hobbit director Peter Jackson, Sheeran saw the film, wrote the song, and recorded most of it on the same day. The song was released as a digital download on 5 November 2013. Its music video was released on the same day. The song has also since been nominated for a Satellite Award for Best Original Song.\n\nPeter Jackson discovered Sheeran through his daughter Katie in early 2013, and then met him while he was touring in New Zealand. When searching for an artist to record the end-credit of The Desolation of Smaug, Peter Jackson and producer/co-writer Fran Walsh decided, following the advice of their daughter, to ask him to write and perform the song. The Hobbit was the first book Sheeran ever read, and he was a fan of both Tolkien's and Jackson's work.\n\nIn only one day, Sheeran watched the film at Park Road Post, immediately went to a room to write the song, and recorded most of it. Despite having never played the violin, he chose to perform it himself via overdubbing. Sheeran commented on the production stating, \"I got the chance to produce and play all the instruments on it apart from the cello (... and I) managed to learn (the) violin for a day\". Flight of the Conchords' touring cellist Nigel Collins added cello parts, dictated by Sheeran. Pete Cobbin from Abbey Road Studios, responsible for mixing the musical score of The Desolation of Smaug by Howard Shore, was at Park Road at the same time and mixed \"I See Fire\", with Jackson being present during the whole recording <a href=\"http://www.last.fm/music/Ed+Sheeran/_/I+See+Fire\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}, {"album": "+", "play_count": "3272995", "name": "Lego House", "img": "https://lastfm-img2.akamaized.net/i/u/174s/fa36962445080a3357cd1585fd2cb474.png", "tags": ["acoustic", "british", "soul", "folk", "alternative"], "lyrics": "I'm gonna pick up the pieces and build a Lego house\nIf things go wrong, we can knock it down\nMy three words have two meanings\nBut there's one thing on my mind, it's all for you\n\nAnd it's dark in a cold December\nBut I've got ya to keep me warm\nIf you're broken, I will mend ya and I'll keep you\nSheltered from the storm that's raging on now\n\nI'm out of touch, I'm out of love\nI'll pick you up when you're getting down\nAnd out of all these things I've done\nI think I love you better now\n\nI'm out of sight, I'm out of mind\nI'll do it all for you in time\nAnd out of all these things I've done\nI think I love you better now, now\n\nI'm gonna paint you by numbers and color you in\nIf things go right, we can frame it and put you on a wall\nAnd it's so hard to say it but I've been here before\nNow I'll surrender up my heart and swap it for yours\n\nI'm out of touch, I'm out of love\nI'll pick you up when you're getting down\nAnd out of all these things I've done\nI think I love you better now\n\nI'm out of sight, I'm out of mind\nI'll do it all for you in time\nAnd out of all these things I've done\nI think I love you better now\n\nDon't hold me down\nI think my braces are breaking\nAnd it's more than I can take\n\nAnd it's a dark and cold December\nBut I've got ya to keep me warm\nIf you're broken, I will mend ya and I'll keep you\nSheltered from the storm that's raging on now\n\nI'm out of touch, I'm out of love\nI'll pick you up when you're getting down\nAnd out of all these things I've done\nI think I love you better now\n\nI'm out of sight, I'm out of mind\nI'll do it all for you in time\nAnd out of all these things I've done\nI think I love you better now\n\nI'm out of touch, I'm out of love\nI'll pick you up when you're getting down\nAnd out of all these things I've done\nI will love you better now", "youtube": {"duration": 246, "date_published": "2011-10-20 11:57:55", "video_id": "c4BLVznuWnU", "description": "Official music video for Ed Sheeran's 'Lego House', featuring Rupert Grint from Harry Potter (Ron Weasley). Go behind the scenes of the video shoot here: http://youtu.be/Px6nTLFD6do Subscribe..."}, "description": "The Lego House Songfacts states that the song finds Sheeran using a Lego house as a metaphor for a relationship. \"I'm gonna pick up the pieces and build a Lego house, if things go wrong, we can knock it down,\" he sings.\n\nEd Sheeran triumphed at this year's Brits scooping not one but two awards for 'Best Male Artist' and 'Best British Breakthrough Act'. 21 year old Ed made a huge impact on the UK singles charts in 2011 with debut single and No.3 hit 'The A Team', followed by 'You Need Me, I Don't Need You' which peaked at No.4 – he then continued the charge with 'Lego House' which scored him a No.5 smash in November 2011. <a href=\"http://www.last.fm/music/Ed+Sheeran/_/Lego+House\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}, {"album": "x", "play_count": "3079804", "name": "Photograph", "img": "https://lastfm-img2.akamaized.net/i/u/174s/fa36962445080a3357cd1585fd2cb474.png", "tags": ["love at first listen", "pop", "emotional", "my song", "best song of the world"], "lyrics": "Loving can hurt, loving can hurt sometimes\nBut it's the only thing that I know\nWhen it gets hard, you know it can get hard sometimes\nIt is the only thing that makes us feel alive\n\nWe keep this love in a photograph\nWe made these memories for ourselves\nWhere our eyes are never closing\nHearts are never broken\nTime's forever frozen still\n\nSo you can keep me\nInside the pocket of your ripped jeans\nHolding me close until our eyes meet\nYou won't ever be alone, wait for me to come home\n\nLoving can heal, loving can mend your soul\nAnd it's the only thing that I know, know\nI swear it will get easier, remember that with every piece of you, mmm\nAnd it's the only thing we take with us when we die\n\nMmm, we keep this love in a photograph\nWe made these memories for ourselves\nWhere our eyes are never closing\nHearts were never broken\nTime's forever frozen still\n\nSo you can keep me\nInside the pocket of your ripped jeans\nHolding me close until our eyes meet\nYou won't ever be alone\nAnd if you hurt me\nThat's okay baby, only words bleed\nInside these pages you just hold me\nAnd I won't ever let you go\nWait for me to come home\nWait for me to come home\nWait for me to come home\nWait for me to come home\n\nOh you can fit me\nInside the necklace you got when you were sixteen\nNext to your heartbeat where I should be\nKeep it deep within your soul\nAnd if you hurt me\nWell that's okay baby, only words bleed\nInside these pages you just hold me\nAnd I won't ever let you go\n\nI will remember how you kissed me\nUnder the lamppost back on Sixth Street\nHearing you whisper through the phone\nWait for me to come home", "youtube": {"duration": 275, "date_published": "2015-05-10 00:40:11", "video_id": "nSDgHBxUbVQ", "description": "Download on iTunes: http://smarturl.it/x-itunesdlx Listen on Spotify: http://smarturl.it/stream.photograph Directed by Emil Nava Subscribe to Ed's channel: http://bit.ly/SubscribeToEdSheeran..."}, "description": null}], "events": [{"city": "Perth", "description": "Ed Sheeran Perth", "title": "Ed Sheeran Perth", "url": "http://perth.eventful.com/events/ed-sheeran-perth-/E0-001-103418102-5?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Australia", "venue": "Perth Stadium", "date": "2018-03-02 19:00:00"}, {"city": "Perth", "description": "Ed Sheeran Perth", "title": "Ed Sheeran Perth", "url": "http://perth.eventful.com/events/ed-sheeran-perth-/E0-001-102985778-0?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Australia", "venue": "Perth Stadium", "date": "2018-03-03 19:00:00"}, {"city": "Adelaide", "description": " Ed Sheeran Adelaide", "title": "Ed Sheeran Adelaide", "url": "http://adelaide.eventful.com/events/ed-sheeran-adelaide-/E0-001-102986351-4?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Australia", "venue": "Adelaide Oval", "date": "2018-03-07 19:00:00"}, {"city": "Warsaw", "description": " Ed Sheeran has been making a stir for some time now, and it is only fitting that a concert should surely follow. But where does one get tickets? Well right here, of course! Yes here at StubHub we’ve got all the Ed Sheeran tickets you need! With Ed Sheeran performing at the Stadion Narodowy it is imperative you buy your Ed Sheeran Warsaw tickets as a concert of this magnitude does not come twice in a row!", "title": "Ed Sheeran Warsaw", "url": "http://eventful.com/warsaw/events/ed-sheeran-warsaw-/E0-001-104217942-3?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Poland", "venue": "Stadion Narodowy w Warszawie", "date": "2018-08-11 17:00:00"}, {"city": "Gothenburg", "description": " Step right up folks, we’ve finally got Ed Sheeran Gothenburg tickets for you to buy! Yes with Ed Sheeran currently the talk of the town, we can’t be more thrilled about the prospect! Set to headline at the great Ullevi Stadium, Ed Sheeran is bound to make dreams and come true with fans scrambling for tickets! So don’t be disappointed and in the dark, buy your Ed Sheeran Gothenburg tickets now!", "title": "Ed Sheeran Gothenburg", "url": "http://eventful.com/events/ed-sheeran-gothenburg-/E0-001-104217889-5?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Sweden", "venue": "Ullevi", "date": "2018-07-10 19:30:00"}, {"city": "Saint Denis", "description": "Step right up folks, we’ve finally got Ed Sheeran Paris tickets for you to buy! Yes with Ed Sheeran currently the talk of the town, we can’t be more thrilled about the prospect! Set to headline at the great Stade de France, Ed Sheeran is bound to make dreams and come true with fans scrambling for tickets! So don’t be disappointed and in the dark, buy your Ed Sheeran Paris tickets now!", "title": "Ed Sheeran Paris", "url": "http://eventful.com/events/ed-sheeran-paris-/E0-001-104569182-9?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "France", "venue": "Stade de France", "date": "2018-07-07 20:00:00"}, {"city": "Solna", "description": " Ed Sheeran is back on tour ready to liven up every city! Ed Sheeran is finally coming to your town, so buy Ed Sheeran Stockholm tickets and watch your favourite musician take the stage at Friends Arena. Tickets are selling very fast and this is a show that you just can&#39;t miss. Get to feel like a child again and scream at the top of your lungs as you see Ed Sheeran perform live. Don&#39;t think of it twice, because you know that this event will be a great hit. Purchase your Ed Sheeran Stockholm tickets and have the time of your life!", "title": "Ed Sheeran Stockholm", "url": "http://eventful.com/events/ed-sheeran-stockholm-/E0-001-104217891-0?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Sweden", "venue": "Friends Arena", "date": "2018-07-14 19:30:00"}, {"city": "Munich", "description": " That time is approaching... yes, that&#39;s right, Ed Sheeran is performing once again! Don&#39;t miss the chance to see Ed Sheeran live at the Olympiastadion. This will be an incredible experience and is set to be one of the best concerts of this year! Buy your Ed Sheeran Munich tickets here at StubHub today. We have the best selection of tickets, so you don&#39;t need to look any further.", "title": "Ed Sheeran Munich", "url": "http://munich.eventful.com/events/ed-sheeran-munich-/E0-001-104590170-8?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Germany", "venue": "Kleine Olympiahalle", "date": "2018-07-30 19:00:00"}, {"city": "Warsaw", "description": " If you are a fan of Ed Sheeran, then you are definitely in luck, because here at StubHub we&#39;ve got the Ed Sheeran Warsaw tickets for you!  Better hurry up and get your hands on some now while they last.  StubHub offers a wide range of concert tickets, and luckily for you, a selection of tickets for Ed Sheeran Warsaw so that you can be there at Stadion Narodowy and watch the performance live!  Don&#39;t waste another moment and secure your place in the crowd with your Ed Sheeran Warsaw tickets from StubHub!", "title": "Ed Sheeran Warsaw", "url": "http://eventful.com/warsaw/events/ed-sheeran-warsaw-/E0-001-104590171-7?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Poland", "venue": "Stadion Narodowy w Warszawie", "date": "2018-08-12 17:00:00"}, {"city": "Gothenburg", "description": " Ed Sheeran concerts are on a roll and if you want to be a part of this one, then you better get your Ed Sheeran Gothenburg tickets here at StubHub before it&#39;s too late.  With our trusty online ticket marketplace, you can find tickets for concerts everywhere, and we have finally got the tickets for Ed Sheeran Gothenburg that you need to get out to Ullevi Stadium and have the time of your life.  So hit the ground running (or dancing) and get your very own Ed Sheeran Gothenburg ticket here and now!", "title": "Ed Sheeran Gothenburg", "url": "http://eventful.com/events/ed-sheeran-gothenburg-/E0-001-104590169-2?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Sweden", "venue": "Ullevi", "date": "2018-07-11 19:30:00"}], "description": "Edward Christopher \"Ed\" Sheeran (born 17 February 1991) is a singer songwriter currently signed under Atlantic (WMG). Sheeran was born in Halifax, West Yorkshire before moving to Framlingham, Suffolk. In his time in Suffolk, he was known to have flourished as a hidden talent when it came to music. He learned guitar at a very young age, and began writing songs during his time at Thomas Mills High School in Framlingham. By the time Sheeran had left school, he was already certain that music was going to play a major part in his life, and therefore studied at Access To Music in Norwich before moving to London which improved his chances of getting gigs.\n\nSheeran began recording in 2005, which lead to the release of his first EP, The Orange Room EP. Sheeran also released two albums, a self titled one in 2006 and Want Some? in 2007 gaining little attention. After Sheeran moved to London and had done extensive gigging, performing songs from his EP and albums, as well as ones which he had recently written, he decided to release another EP, You Need Me in late 2009. However, it wasn't until February 2010 that Sheeran began to get noticed after he posted a video through SB.tv displaying his diverse style. This video led to mainstream rapper Example asking Sheeran to tour with him. Throughout 2010, Sheeran began to be seen by more and more people over the internet through Youtube and his fan-base grew incredibly, with him also getting credit from The Independent newspaper, England football captain Rio Ferdinand and even Elton John. Sheeran released three EP's in 2010, Loose Change, which features one of his most known songs, \"The A Team\", Songs I Wrote With Amy, and Ed Sheeran: Live at the Bedford, a live EP recorded in October. During the year, Sheeran also went to the US, where he was discovered by international superstar Jamie Foxx, who asked Sheeran to perform on his radio show, which gained him some fans in the US. By the end of the year, Sheeran was seen to be one of the best unsigned artists in the country. \nOn 9 January 2011, Sheeran released his final independent EP, No.5 Collaborations Project featuring appearances by grime artists including Wiley, JME, Devlin and Ghetts. With this EP, Sheeran gained mainstream attention for reaching number 2 in the iTunes chart, without any promotion or label. He was listed as a 'special guest' on Devlin's 2011 'Bud, Sweat and Beers' mini tour alongside Griminal and Tinchy Stryder. Songfacts reports that after signing for Atlantic Records in January 2011 \"The A Team\" was released as the first single from his debut album on June 12, 2011.\n\nSheeran's debut album + containing the singles The A Team and Lego House is certified 6x Platinum in the UK. The album has also won Sheeran two Brit Awards for British Breakthrough Act and Best British Male Solo Artist. At the 56th Annual Grammy Awards Sheeran gained a nomination for Best New Artist. \n\nHe received further fame for contributing the track entitled \"I See Fire\" to Howard Shore's soundtrack to the movie \"The Hobbit: The Desolation of Smaug\" in 2013.\n\nx the second studio album by Sheeran was released in 2015. The album went straight to number one in both the UK and the US. x has had five singles thus far Sing, Don't, Thinking Out Loud, Bloodstream and Photograph.\n\nSheeran recently was awarded with an Honorary Doctorate by the University Campus Suffolk (UCS). The ceremony is later this year. \n\nDiscography:.\n\nAlbums:\n\n2011 - +\n2014 - x\n2017 - ÷\n\nEPs:\n\n2005 - The Orange Room\n2006 - Ed Sheeran\n2007 - Want Some?\n2009 - You Need Me\n2010 - Loose Change\n2010 - Songs I Wrote With Amy\n2010 - Live At The Bedford\n2011 - No 5 Collaborations Project\n2011 - One Take\n2011 - iTunes Festival: London 2011\n2011 - Thank You\n2012 - The Slumdon Bridge\n2012 - iTunes Festival: London 2012\n\nSingles:\n\n2011 - The A Team\n2011 - You Need Me, I Don't Need You\n2011 - Lego House\n2012 - Drunk\n2012 - Small Bump\n2012 - Give Me Love\n2013 - I See Fire\n2014 - Sing\n2014 - Don't\n2014 - Thinking Out Loud\n2015 - Bloodstream\n2015 - Photograph\n2017 - Shape of you\n2017 - Castle on the Hill\n2017 - Galway Girl <a href=\"https://www.last.fm/music/Ed+Sheeran\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}, {"name": "Eminem", "img": "https://lastfm-img2.akamaized.net/i/u/64s/7e8f5298d7a546d1bdcdba37a8456a68.png", "play_count": "182272858", "tracks": [{"album": "Curtain Call: The Hits", "play_count": "5406993", "name": "Lose Yourself", "img": "https://lastfm-img2.akamaized.net/i/u/174s/a3e4633832d14231a84903fcb30a6ea7.png", "tags": ["rap", "Hip-Hop", "Eminem", "hip hop", "Soundtrack"], "lyrics": "Look, if you had one shot or one opportunity\nTo seize everything you ever wanted in one moment...\nWould you capture it or just let it slip?\n\n(Yo) His palms are sweaty, knees weak, arms are heavy\nThere's vomit on his sweater already, mom's spaghetti\nHe's nervous, but on the surface he looks calm and ready\nTo drop bombs, but he keeps on forgetting\n\nWhat he wrote down, the whole crowd goes so loud\nHe opens his mouth, but the words won't come out\nHe's chokin' how, everybody's jokin' now\nThe clocks runs out, time's up, over, blow\n\nSnap back to reality, oh, there goes gravity, oh\nThere goes Rabbit, he choked, he's so mad but he won't\nGive up that easy no, he won't have it he knows\nHis whole back's to these ropes, it don't matter he's dope\n\nHe knows that but he's broke, he's so stagnant he knows\nWhen he goes back to his mobile home, that's when it's\nBack to the lab again yo, this whole rhapsody\nHe better go capture this moment and hope it don't pass him\n\nYou better lose yourself in the music, the moment\nYou own it, you better never let it go\nYou only get one shot, do not miss your chance to blow\nThis opportunity comes once in a lifetime\n\nYou better lose yourself in the music, the moment\nYou own it, you better never let it go\nYou only get one shot, do not miss your chance to blow\nThis opportunity comes once in a lifetime (You better)\n\nHis soul's escaping through this hole that is gaping\nThis world is mine for the taking, make me king\nAs we move toward a new world order\nA normal life is boring, but super-stardom's\n\nClose to postmortem, it only grows harder\nOnly grows hotter, he blows us all over\nThese hoes is all on him, coast to coast shows\nHe's known as the Globetrotter, lonely roads God only knows\n\nHe's grown farther from home, he's no father\nHe goes home, and barely knows his own daughter\nBut hold your nose, 'cause here goes the cold water\nThese hoes don't want him no mo', he's cold product\n\nThey moved on to the next schmoe who flows\nHe nose dove and sold nada, so the soap opera\nIs told and unfolds, I suppose it's old partna'\nBut the beat goes on, da da dum da dum da da da dum\n\nYou better lose yourself in the music, the moment \nYou own it, you better never let it go \nYou only get one shot, do not miss your chance to blow \nThis opportunity comes once in a lifetime \n\nYou better lose yourself in the music, the moment \nYou own it, you better never let it go\nYou only get one shot, do not miss your chance to blow \nThis opportunity comes once in a lifetime (You better)\n\nNo more games, I'mma change what you call rage\nTear this motherfuckin' roof off, like two dogs caged\nI was playin' in the beginning, the mood all changed\nI been chewed up and spit out and booed off stage\n\nBut I kept rhymin' and stepped right in the next cipher\nBest believe somebody's payin' the Pied Piper\nAll the pain inside amplified by the\nFact that I can't get by with my nine to five\n\nAnd I can't provide the right type of\nLife for my family, 'cause man these goddamn\nFood stamps don't buy diapers\nAnd there's no movie, there's no Mekhi Phifer, this is my life\n\nAnd these times are so hard, and it's getting even harder\nTryin' to feed and water my seed, plus teeter-totter\nCaught up between bein' a father and a Prima Donna\nBaby mama drama screamin' on and too much for me to wanna\n\nStay in one spot, another day of monotony\nHas gotten me to the point I'm like a snail I've got\nTo formulate a plot or end up in jail or shot\nSuccess is my only motherfuckin' option, failure's not\n\nMom I love you, but this trailer's got to go\nI cannot grow old in Salem's Lot\nSo here I go, it's my shot, feet fail me not\nThis may be the only opportunity that I got\n\nYou better lose yourself in the music, the moment\nYou own it, you better never let it go\nYou only get one shot, do not miss your chance to blow\nThis opportunity comes once in a lifetime\n\nYou better lose yourself in the music, the moment\nYou own it, you better never let it go\nYou only get one shot, do not miss your chance to blow\nThis opportunity comes once in a lifetime (You better)\n\nYou can do anything you set your mind to, man.", "youtube": {"duration": 324, "date_published": "2015-08-07 01:12:12", "video_id": "_Yhyp-_hX2s", "description": "feat. Eminem from the movie 8 MILE No copyright infringement intended. All contents belong to its rightful owners. This is for entertainment purposes only."}, "description": "Lose Yourself is an Academy-award-winning song featured in the film  8 Mile. According to Songfacts, on the movie set, Eminem had a trailer where he could record songs for the movie during breaks in filming. He wrote this in character as B. Rabbit, the film's protagonist. <a href=\"http://www.last.fm/music/Eminem/_/Lose+Yourself\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}, {"album": "The Marshall Mathers LP", "play_count": "3336439", "name": "The Real Slim Shady", "img": "https://lastfm-img2.akamaized.net/i/u/174s/a3e4633832d14231a84903fcb30a6ea7.png", "tags": ["rap", "Hip-Hop", "Eminem", "hip hop", "00s"], "lyrics": "May I have your attention, please?\nMay I have your attention, please?\nWill the real Slim Shady please stand up?\nI repeat: Will the real Slim Shady please stand up?\nWe're gonna have a problem here\n\nY'all act like you've never seen a white person before\nJaws all on the floor like Pam, like Tommy just burst in the door\nAnd started whoopin' her ass worse than before\nThey first were divorced, throwin' her over furniture (ahh!)\n\nIt's the return of the... \"Ah, wait, no way, you're kidding\nHe didn't just say what I think he did, did he?\"\nAnd Dr. Dre said... nothing, you idiots\nDr. Dre's dead, he's locked in my basement (ha, ha!)\n\nFeminist women love Eminem\n\"Chicka, chicka, chicka, Slim Shady, I'm sick of him\nLook at him walking around grabbing his you-know-what\nFlipping the you-know-who.\" \"Yeah, but he's so cute though\"\n\nYeah, I probably got a couple of screws up in my head loose\nBut no worse than what's goin' on in your parents' bedrooms (Uhh-uhh-uhh!)\nSometimes, I wanna get on TV and just let loose but can't\nBut it's cool for Tom Green to hump a dead moose\n\n\"My bum is on your lips, my bum is on your lips\"\nAnd if I'm lucky, you might just give it a little kiss\nAnd that's the message that we deliver to little kids\nAnd expect them not to know what a woman's clitoris is\n\nOf course they're gonna know what intercourse is by the time they hit fourth grade\nThey got the Discovery Channel, don't they?\nWe ain't nothing but mammals... well, some of us, cannibals\nWho cut other people open like cantaloupes\n\nBut if we can hump dead animals and antelopes\nThen there's no reason that a man and another man can't elope (eugh!)\nBut if you feel like I feel, I got the antidote\nWomen wave your pantyhose; sing the chorus, and it goes\n\nI'm Slim Shady, yes I'm the real Shady\nAll you other Slim Shadys are just imitating\nSo won't the real Slim Shady please stand up\nPlease stand up, please stand up?\n\n'Cause Slim Shady, yes I'm the real Shady\nAll you other Slim Shadys are just imitating\nSo won't the real Slim Shady please stand up\nPlease stand up, please stand up?\n\nWill Smith don't gotta cuss in his raps to sell records\nWell I do, so fuck him and fuck you, too\nYou think I give a damn about a Grammy?\nHalf o' you critics can't even stomach me, let alone stand me\n\n\"But Slim, what if you win, wouldn't it be weird?\"\nWhy, so you guys can just lie to get me here?\nSo you can sit me here next to Britney Spears?\nYo shit, Christina Aguilera better switch me chairs\n\nSo I can sit next to Carson Daly and Fred Durst\nAnd hear 'em argue over who she gave head to first\nLittle bitch put me on blast on MTV\n\"Yeah he's cute, but I think he's married to Kim, hehe\"\n\nI should download her audio on MP3\nAnd show the whole world how you gave Eminem VD (ahh!)\nI'm sick of you little girl and boy groups; all you do is annoy me\nSo I have been sent here to destroy you\n\nAnd there's a million of us just like me\nWho cuss like me, who just don't give a fuck like me\nWho dress like me, walk, talk, and act like me\nAnd just might be the next best thing but not quite me\n\n'Cause I'm Slim Shady, yes I'm the real Shady\nAll you other Slim Shadys are just imitating\nSo won't the real Slim Shady please stand up\nPlease stand up, please stand up?\n\n'Cause I'm Slim Shady, yes I'm the real Shady\nAll you other Slim Shadys are just imitating\nSo won't the real Slim Shady please stand up\nPlease stand up, please stand up?\n\nI'm like a head trip to listen to, 'cause I'm only giving you\nThings you joke about with your friends, inside your livin' room\nThe only difference is I got the balls to say it in front of y'all\nAnd I don't gotta be false or sugar-coat it all\n\nI just get on the mic and spit it\nAnd whether you like to admit it (rip), I just shit it\nBetter than ninety percent of you rappers out can\nThen you wonder how can kids eat up these albums like Valiums\n\nIt's funny, 'cause at the rate I'm going, when I'm thirty\nI'll be the only person in the nursin' home flirting\nPinchin' nurses asses, while I'm jackin' off with Jergens\nAnd I'm jerkin', but this whole bag of Viagra isn't workin'\n\nIn every single person there's a Slim Shady lurkin'\nWho could be workin' at Burger King, spittin' on your onion rings\nOr in the parking lot circling, screamin' \"I don't give a fuck\"\nWith his windows down and his system up\n\nSo will the real Shady please stand up\nAnd put one of those fingers on each hand up\nAnd be proud to be outta your mind and outta control\nAnd one more time, loud as you can, how does it go?\n\n'Cause I'm Slim Shady, yes I'm the real Shady\nAll you other Slim Shadys are just imitating\nSo won't the real Slim Shady please stand up\nPlease stand up, please stand up?\n\n'Cause I'm Slim Shady, yes I'm the real Shady\nAll you other Slim Shadys are just imitating\nSo won't the real Slim Shady please stand up\nPlease stand up, please stand up?\n\n'Cause I'm Slim Shady, yes I'm the real Shady\nAll you other Slim Shadys are just imitating\nSo won't the real Slim Shady please stand up\nPlease stand up, please stand up?\n\nI'm Slim Shady, yes I'm the real Shady\nAll you other Slim Shadys are just imitating\nSo won't the real Slim Shady please stand up\nPlease stand up, please stand up?\n\nHaha, guess there's a Slim Shady in all of us\nFuck it, let's all stand up", "youtube": {"duration": 268, "date_published": "2010-09-15 16:41:05", "video_id": "eJO5HU_7_1w", "description": "Playlist Best of Eminem: https://goo.gl/AquNpo Subscribe for more: https://goo.gl/DxCrDV Music video by Eminem performing The Real Slim Shady. (C) 2000 Aftermath Entertainment/Interscope Records."}, "description": null}, {"album": "Recovery", "play_count": "4526811", "name": "Not Afraid", "img": "https://lastfm-img2.akamaized.net/i/u/174s/a3e4633832d14231a84903fcb30a6ea7.png", "tags": ["rap", "Eminem", "hip hop", "Hip-Hop", "not afraid"], "lyrics": "I'm not afraid (I'm not afraid) (Yeah) to take a stand (to take a stand) (It's been a ride)\nEverybody (I guess I had to) (everybody), come take my hand (Go to that place) (come take my hand) (To get to this one)\nWe'll walk this road together (Now some of you) through the storm\nWhatever weather (Might still be in that place) cold or warm (If you're tryin to get out)\nJust lettin' you know that, you're not alone (Just follow me)\nHolla if you feel like (I'll get you there) you've been down the same road\n\nYou can try and read my lyrics off of this paper, before I lay 'em\nBut you won't take the sting out these words, before I say 'em\n'Cause ain't no way I'ma let you stop me from causin' mayhem\nWhen I say I'ma do somethin' I do it, I don't give a damn\n\nWhat you think, I'm doin' this for me, so fuck the world feed it beans\nIt's gassed up, if it thinks it's stoppin' me\nI'ma be what I set out to be, without a doubt undoubtedly\nAnd all those who looked down on me, I'm tearin' down your balcony\n\nNo if ands or buts, don't try to ask him why or how can he\nFrom Infinite down to the last Relapse album, he's still shittin'\nWhether he's on salary, paid hourly\nUntil he bows out or he shits his bowels out of him\n\nWhichever comes first, for better or worse\nHe's married to the game, like a \"fuck you\" for Christmas\nHis gift is a curse, forget the earth, he's got the urge\nTo pull his dick from the dirt and fuck the whole universe\n\nI'm not afraid (I'm not afraid) to take a stand (to take a stand)\nEverybody (everybody), come take my hand (come take my hand)\nWe'll walk this road together, through the storm\nWhatever weather, cold or warm\nJust lettin' you know that, you're not alone\nHolla if you feel like you've been down the same road\n\nOK quit playin' with the scissors and shit, and cut the crap\nI shouldn't have to rhyme these words in a rhythm, for you to know it's a rap\nYou said you was king, you lied through your teeth, for that\nFuck your feelin's, instead of gettin' crowned you're gettin' capped\n\nAnd to the fans, I'll never let you down again, I'm back\nI promise to never go back on that promise, in fact\nLet's be honest, that last Relapse CD was eh\nPerhaps I ran them accents into the ground\n\nRelax, I ain't goin' back to that now\nAll I'm tryna say is get back, click-clack-bloww\n'Cause I ain't playin' around, there's a game called circle\nAnd I don't know how, I'm way too up to back down\n\nBut I think I'm still tryin' to figure this crap out\nThought I had it mapped out but I guess I didn't, this fuckin' black cloud\nStill follows me around, but it's time to exorcise these demons\nThese motherfuckers are doin' jumpin' jacks now\n\nI'm not afraid (I'm not afraid) to take a stand (to take a stand)\nEverybody (everybody), come take my hand (come take my hand)\nWe'll walk this road together, through the storm\nWhatever weather, cold or warm\nJust lettin' you know that, you're not alone\nHolla if you feel like, you've been down the same road\n\nAnd I just can't keep livin' this way\nSo startin' today, I'm breakin' out of this cage\nI'm standin' up, I'ma face my demons\nI'm mannin' up, I'ma hold my ground\nI've had enough, now I'm so fed up\nTime to put my life back together right now\n\nIt was my decision to get clean, I did it for me\nAdmittedly, I probably did it subliminally for you\nSo I could come back a brand new me, you helped see me through\nAnd don't even realize what you did, believe me you\n\nI been through the ringer, but they can do little to the middle finger\nI think I got a tear in my eye, I feel like the king of\nMy world, haters can make like bees with no stingers\nAnd drop dead, no more beef flingers\n\nNo more drama from now on, I promise\nTo focus solely on handlin' my responsibilities as a father\nSo I solemnly swear to always treat this roof, like my daughters and raise it\nYou couldn't lift a single shingle on it\n\n'Cause the way I feel, I'm strong enough to go to the club\nOr the corner pub and lift the whole liquor counter up\n'Cause I'm raisin' the bar, I shoot for the moon\nBut I'm too busy gazin' at stars, I feel amazin' and I'm not\n\nI'm not afraid (I'm not afraid) to take a stand (to take a stand)\nEverybody (everybody), come take my hand (come take my hand)\nWe'll walk this road together, through the storm\nWhatever weather, cold or warm\nJust lettin' you know that, you're not alone\nHolla if you feel like, you've been down the same road", "youtube": {"duration": 259, "date_published": "2010-06-05 05:02:39", "video_id": "j5-yKhDd64s", "description": "Music video by Eminem performing Not Afraid. (C) 2010 Aftermath Records #VEVOCertified on September 11, 2010.http://www.vevo.com/certified http://www.youtube.com/vevocertified."}, "description": "\"Not Afraid\" is the first single from American rapper Eminem's seventh studio album Recovery. The single was produced by Boi-1da. It debuted on April 29, 2010 on Shade 45. Unlike all his previous first album singles \"My Name Is\", \"The Real Slim Shady\", \"Without Me\", \"Just Lose It\" and \"We Made You\", this song is not a comedy hip hop song, instead has much more deep and meaningful lyrics.\n\nOn April 27, 2010, Eminem released a freestyle titled \"Despicable\" over \"Over\" by Drake and \"Beamer, Benz, or Bentley\" by Lloyd Banks as promo for the single.\n\nIn the song, described as \"uplifting\" by manager Paul Rosenberg, Eminem tells of how he has tried to overcome the troubles in his life from the past few years, mainly his drug addiction and rehabilitation. He also notes that he will no longer use the accent in the future right after saying how his last album, Relapse, wasn't as good compared to his previous albums. He promises he will never leave again and now only has his daughters and his music to focus on.\"\n\nThe song was featured on 24/7, showcasing the preparations of the Floyd Mayweather vs. Shane Mosley fight. <a href=\"http://www.last.fm/music/Eminem/_/Not+Afraid\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}, {"album": "Encore", "play_count": "3272359", "name": "Mockingbird", "img": "https://lastfm-img2.akamaized.net/i/u/174s/a3e4633832d14231a84903fcb30a6ea7.png", "tags": ["rap", "Eminem", "Hip-Hop", "hip hop", "mockingbird"], "lyrics": "Spoken\nYeah, I know sometimes things may not always make sense to you right now\nBut hey, what daddy always tell you?\nStraighten up little soldier, stiffen up that upper lip\nWhat you crying about?\nYou got me.\n\nHailie, I know you miss your mom and I know you miss your dad\nWhen I'm gone, but I'm trying to give you the life that I never had\nI can see you're sad, even when you smile, even when you laugh\nI can see it in your eyes, deep inside you want to cry\n\n'Cause you're scared, I ain't there? Daddy's with you in your prayers\nNo more crying, wipe them tears, daddy's here, no more nightmares\nWe gon' pull together through it, we gon' do it\nLaney uncle's crazy, ain't he? Yeah but he loves you girl and you better know it\n\nWe're all we got in this world When it spins, when it swirls\nWhen it whirls, when it twirls two little beautiful girls\nLookin' puzzled, in a daze, I know it's confusin' you\nDaddy's always on the move, mama's always on the news\n\nI try to keep you sheltered from it, but somehow it seems\nThe harder that I try to do that, the more it backfires on me\nAll the things growing up his daddy, that he had to see\nDaddy don't want you to see but you see just as much as he did\n\nWe did not plan it to be this way, your mother and me\nBut things have gotten so bad between us I don't see us ever being together\nEver again like we used to be when we was teenagers\nBut then of course everything always happens for a reason\n\nI guess it was never meant to be\nBut it's just something we have no control over and that's what destiny is\nBut no more worries, rest your head and go to sleep\nMaybe one day we'll wake up and this will all just be a dream\n\nNow hush little baby, don't you cry\nEverything's gonna be alright\nStiffen that upper lip up little lady, I told ya\nDaddy's here to hold ya through the night\n\nI know mommy's not here right now and we don't know why\nWe fear how we feel inside\nIt may seem a little crazy, pretty baby\nBut I promise mama's gon' be alright\n\nIt's funny, I remember back one year, when daddy had no money\nMommy wrapped the Christmas presents up, and stuck 'em under the tree\nAnd said some of 'em were from me, 'cause daddy couldn't buy 'em\nI'll never forget that Christmas I sat up the whole night crying\n\n'Cause daddy felt like a bum, see daddy had a job\nBut his job was to keep the food on the table for you and mom\nAnd at the time every house that we lived in either kept getting broke into and robbed\nOr shot up on the block and your mom\n\nWas saving money for you in a jar\nTryna start a piggy bank for you so you could go to college\nAlmost had a thousand dollars till someone broke in and stole it\nAnd I know it hurt so bad, it broke your mama's heart\nAnd it seemed like everything was just startin' to fall apart\n\nMom and dad was arguin' a lot so mama moved back\nOn the Chalmers in the flat one bedroom apartment\nAnd dad moved back to the other side of 8 Mile on Novara\nAnd that's when daddy went to California with his CD\nAnd met Dr. Dre and flew you and mama out to see me\n\nBut daddy had to work, you and momma had to leave me\nThen you started seeing daddy on the TV\nAnd mama didn't like it and you and Laney were to young to understand it\nPapa was a rollin' stone, momma developed a habit\nAnd it all happened too fast for either one of us to grab it\nI'm just sorry you were there and had to witness it first hand\n\n'Cause all I ever wanted to do was just make you proud\nNow I'm sittin' in this empty house\nJust reminiscing lookin' at your baby pictures, it just trips me out\nTo see how much you both have grown, it's almost like you're sisters now\n\nWow, guess you pretty much are and daddy's still here\nLaney I'm talkin' to you too, daddy's still here\nI like the sound of that, yeah, it's got a ring to it, don't it?\nShh, mama's only gone for the moment\n\nNow hush little baby, don't you cry\nEverything's gonna be alright\nStiffen that upper lip up little lady, I told ya\nDaddy's here to hold ya through the night\n\nI know mommy's not here right now and we don't know why\nWe fear how we feel inside\nIt may seem a little crazy, pretty baby\nBut I promise mama's gon' be alright\n\nAnd if you ask me too, daddy's gonna buy you a mockingbird\nI'mma give you the world\nI'mma buy a diamond ring for you, I'mma sing for you\nI'll do anything for you to see you smile\n\nAnd if that mockingbird don't sing and that ring don't shine\nI'mma break that birdies' neck\nI'd go back to the jeweler who sold it to ya\nAnd make him eat every karat, don't fuck with dad (ha ha)", "youtube": {"duration": 259, "date_published": "2009-12-25 04:20:46", "video_id": "S9bCLPwzSC0", "description": "Playlist Best of Eminem: https://goo.gl/AquNpo Subscribe for more: https://goo.gl/DxCrDV Music video by Eminem performing Mockingbird. YouTube view counts pre-VEVO: 14297644. (C) 2004 Aftermath..."}, "description": "This is a song Eminem made for his daughter, Hailie Jade Mathers.  <a href=\"http://www.last.fm/music/Eminem/_/Mockingbird\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}], "events": [{"city": "Boston", "description": null, "title": "Boston Calling Music Festival with The Killers, Eminem, and Jack White 3 Day Pass Tickets (May 25-27)", "url": "http://boston.eventful.com/events/boston-calling-music-festival-killers-eminem-and-/E0-001-109830981-8?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "United States", "venue": "Harvard Athletics", "date": "2018-05-25 16:59:00"}, {"city": "Indio", "description": null, "title": "Coachella 2018 - 2nd Sunday", "url": "http://eventful.com/indio/events/coachella-2018-2nd-sunday-/E0-001-109666808-1?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "United States", "venue": "Empire Polo Club and Field", "date": "2018-04-22 00:00:00"}, {"city": "Indio", "description": null, "title": "Coachella 2018 - 1st Sunday", "url": "http://eventful.com/indio/events/coachella-2018-1st-sunday-/E0-001-109666243-0?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "United States", "venue": "Empire Polo Club and Field", "date": "2018-04-15 00:00:00"}, {"city": "Phoenix", "description": " with Daniel Jordan, Dienasty, D. Evil aka Uncle Phoenix, Mafiatic Misfits, McNastee<br> Rashaam Attica Smith, better known by his stage name Esham (East Side Hoes And Money), is an American rapper from Detroit, Michigan known for his hallucinogenic style of hip hop which he refers to as &quot;acid rap&quot;. Releasing his debut album, Boomin&#39; Words from Hell while still in high school, Smith is considered to be one of the originators of horrorcore, rap rock and rap metal. Counting Boomin&#39; Words from Hell, he has released twelve studio albums, six extended plays and three compilation albums. Smith co-founded the independent record label Reel Life Productions, and formed the group Natas with local rappers Mastamind and TNT. Smith has been cited as an influence on rappers such as Eminem and Insane Clown Posse.", "title": "Esham", "url": "http://phoenix.eventful.com/events/esham-/E0-001-109823048-4?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "United States", "venue": "Last Exit Live", "date": "2018-01-23 20:00:00"}, {"city": "Phoenix", "description": " \n", "title": "Esham", "url": "http://phoenix.eventful.com/events/esham-/E0-001-109886011-5?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "United States", "venue": "Last Exit Live", "date": "2018-01-23 20:00:00"}, {"city": "Puerto Vallarta", "description": " Stolie Noches every Thursday at Que?Pasa, from 7:30 - 10:30pm", "title": "Stolie", "url": "http://eventful.com/events/stolie-/E0-001-106923185-4@2018011819?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Mexico", "venue": "Que Pasa", "date": "2018-01-18 19:30:00"}, {"city": "Austin", "description": null, "title": "Esham", "url": "http://austin.eventful.com/events/esham-/E0-001-110501790-3?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "United States", "venue": "COME AND TAKE IT LIVE", "date": "2018-03-28 19:00:00"}, {"city": "Reno", "description": " \n", "title": "Esham", "url": "http://eventful.com/reno/events/esham-/E0-001-108358412-3?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "United States", "venue": "Jub Jub's Thirst Parlor (formerly The Broken Spoke)", "date": "2018-01-19 20:30:00"}, {"city": "West Hollywood", "description": null, "title": "Esham", "url": "http://losangeles.eventful.com/events/esham-/E0-001-107430769-2?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "United States", "venue": "Whisky A Go-Go", "date": "2018-01-21 20:00:00"}, {"city": "Hartford", "description": null, "title": "Esham", "url": "http://hartford.eventful.com/events/esham-/E0-001-110487550-4?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "United States", "venue": "Webster Theatre", "date": "2018-03-17 19:00:00"}], "description": "Marshall Bruce Mathers III (born October 17, 1972),  better known by his stage name Eminem/Slim Shady is an American rapper and record producer.  Eminem learned his trade while growing up in Detroit, United States, and quickly gained popularity in 1999 with his major-label album, The Slim Shady LP, which won a Grammy Award for Best Rap Album. The following album, The Marshall Mathers LP, became the fastest-selling solo album in the United States history.\n\nThe Marshall Mathers LP and his third album, The Eminem Show, also won Grammy Awards, making Eminem the first artist to win Best Rap Album for three consecutive LPs. He then won the award again in 2010 for his album Relapse, giving him a total of 11 Grammys in his career. In 2002, he won the Academy Award for Best Original Song for Lose Yourself from the film, 8 Mile, in which he also played the lead. Lose Yourself would go on to become the longest running #1 hip-hop single. \n\nEminem then went on hiatus after touring in 2005. He released his first album since 2004's Encore, titled Relapse, on May 15, 2009. Relapse Part 2 was due to be released in 2010, but scrapped it due to media and fans and so he decided to release his album Recovery instead. Eminem was the best-selling artist of the 2000's on the US Nielsen SoundScan, and has sold more than 80 million albums worldwide to date, making him one of the best-selling music artists in the world. \n\nEminem was ranked 82nd on Rolling Stone magazine's list of the 100 Greatest Artists of All-Time.He was also named the Best Rapper Ever by Vibe magazine. Including his work with D12, Eminem has achieved nine #1 albums on the Billboard Top 200, 7 solo and 2 with D12. Eminem has had 12 number one singles worldwide. \n\nIn December 2009 Eminem was named the Artist of the Decade by Billboard magazine. His albums The Eminem Show, The Marshall Mathers LP, and Encore (in order) ranked as the 3rd. 7th, and 40th best album of the 2000-2009 decade by Billboard magazine. According to Billboard, Eminem has two of his albums among the top five highest selling albums of the 2000s. In the UK, Eminem has sold over 12.5 million records.\n\nOn November 15th 2013, Eminem's eight solo album titled The Marshall Mathers LP 2. Prior to the album's official release, the lead single Berzerk was released on August 25, 2013. It debuted at number 3 on the Billboard Hot 100. The following singles were Survival, which was showcased during the Call of Duty: Ghosts reveal trailer, Rap God, and The Monster featuring Rihanna. The album became Eminem's seventh which debuted at No1 on Billboard 200 and it also generated the second-largest sales of the year 2013. In the United Kingdom, the album debuted at number one on the UK Albums Chart\n\nOn November 10, 2013, Eminem won the Global Icon award at the 2013 MTV EMA Music Awards.\n\nOn November 24, 2014, Eminem released a 2-CD hiphop compilation album \"Shady XV\" - with 12 new tracks and a greatest hits compilation from artists on the Shady Records.\n\nEminem is the executive producer of the soundtrack for the movie Southpaw. Through his record label Shady Records, the first single from the soundtrack entitled \"Phenomenal\" was released June 2015. The album was released on July 24, 2015. \n\nDiscography:\nInfinite (1996)\nThe Slim Shady LP (1999)\nThe Marshall Mathers LP (2000)\nDevil's Night (with D12) (2001)\nThe Eminem Show (2002)\nD12 World (with D12) (2004)\nEncore (2004)\nRelapse (2009)\nRecovery (2010)\nThe Marshall Mathers LP 2 (2013)\nRevival (2017)\n\n\n <a href=\"https://www.last.fm/music/Eminem\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}, {"name": "Kendrick Lamar", "img": "https://lastfm-img2.akamaized.net/i/u/64s/fa53efb99b075d4f4d59bb8969500b5a.png", "play_count": "80470387", "tracks": null, "events": [{"city": "Copenhagen", "description": "Don&#39;t miss the concert of the year: Kendrick Lamar Copenhagen live! Buy your tickets for Kendrick Lamar at Royal Arena now on StubHub This will be a concert like you have never experienced before. Buy your Kendrick Lamar Copenhagen tickets through our secure and fast online system to be able to enjoy this great event. You won&#39;t regret it!", "title": "Kendrick Lamar Copenhagen", "url": "http://eventful.com/copenhagen/events/kendrick-lamar-copenhagen-/E0-001-107393297-8?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Denmark", "venue": "Royal Arena", "date": "2018-03-01 20:00:00"}, {"city": "Paris", "description": " The time has come to purchase your Kendrick Lamar tickets, because it&#39;s true, Kendrick Lamar is indeed setting to perform in the ever impressive AccorHotels Arena! Considering that Kendrick Lamar  has since become one of the most popular artists this decade has to offer, you know your in for a show your set to remember for the rest of your life!  So make sure you get your Kendrick Lamar Paris tickets and you attend this unforgettable show in person. Sing along to some of the greatest songs, dance and jump until it hurts! Rest assured- you will have the time of your life! So what&#39;s taking you so long? Don&#39;t hesitate and get your Kendrick Lamar Paris tickets right here, at StubHub!", "title": "Kendrick Lamar Paris", "url": "http://paris.eventful.com/events/kendrick-lamar-paris-/E0-001-107332572-5?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "France", "venue": "Accor Hôtels Arena", "date": "2018-02-25 20:00:00"}, {"city": "Dublin", "description": " After our sell out &#39;I Didnt Get A Ticket Party&#39; for LCD Soundsystem, it felt like our duty to return with a special 2018 party for Kendrick Lamar, who let&#39;s be honest, none of us got tickets for.We know it&#39;s in February, but just like the real party, it&#39;s something to look forward to. It also guarentees you&#39;ll have a load of fun regardless.Join us for an entire night of Kendrick Lamar with one of two other classics throw in for good measure. ", "title": "Kendrick Lamar - I Didn't Get A Ticket Party", "url": "http://dublin.eventful.com/events/kendrick-lamar-i-didnt-get-ticket-party-/E0-001-107452594-2?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Ireland", "venue": "The Grand Social (Formerly Pravda)", "date": "2018-02-07 22:30:00"}, {"city": "Oslo", "description": "Med syv Grammy-priser under beltet inntar Kendrick Lamar, Europa med THE DAMN. TOUR våren 2018. Med seg har han den Grammy-nominerte og Mercury Pris-vinnende artisten James Blake. THE DAMN. TOUR etterfølger hans kritikerroste fjerde album DAMN., som debuterte på førsteplass på Billboard 200. Dette er tredje gang Kendrick tar denne topplasseringen, og albumet har til dagsdato solgt over 2,3 millioner og blitt streamet over 400 millioner ganger.\n\nKendrick Lamar har tidligere levert to fantastiske konserter i Oslo i 2013, og imponerte både publikum og anmeldere. Nå er det bare å begynne å glede seg til en av dagens største og mest aktuelle rappere tar turen tilbake i mars 2018.\n\nPremium Billett &quot;View from the top&quot; inkluderer:\n\n\n\tVIP inngang\n\tVIP Balkong (Sitteplass med fantastisk utsikt til scene og publikum)\n\tVelkomstdrikke\n\tTilgang til egen bar under hele arrangementet\n\tSnacks\n\nPris: 1395,-\n", "title": "Premium billetter - Kendrick Lamar with special guest James Blake", "url": "http://eventful.com/oslo/events/premium-billetter-kendrick-lamar-special-guest-james-/E0-001-107327671-1?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Norway", "venue": "Telenor Arena", "date": "2018-03-02 17:00:00"}, {"city": "Stockholm", "description": " \n", "title": "Kendrick Lamar", "url": "http://eventful.com/stockholm/events/kendrick-lamar-/E0-001-107341750-3?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Sweden", "venue": "Stockholm Globe Arenas", "date": "2018-03-03 19:30:00"}, {"city": "Dublin", "description": " \n", "title": "Kendrick Lamar", "url": "http://dublin.eventful.com/events/kendrick-lamar-/E0-001-107341718-7?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Ireland", "venue": "3Arena", "date": "2018-02-07 00:00:00"}, {"city": "Birmingham", "description": " <strong>Customers have to be over 14 years of age to attend this event.</strong> Under 16s must be accompanied by an adult. ", "title": "Kendrick Lamar", "url": "http://eventful.com/events/kendrick-lamar-/E0-001-107391568-9?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "United Kingdom", "venue": "Genting Arena (formerly LG Arena)", "date": "2018-02-09 00:00:00"}, {"city": "Antwerp", "description": " \n", "title": "Kendrick Lamar", "url": "http://eventful.com/antwerp/events/kendrick-lamar-/E0-001-107341849-6?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Belgium", "venue": "Sportpaleis Antwerpen", "date": "2018-02-27 18:30:00"}, {"city": "Stadt Frankfurt", "description": " \n", "title": "Kendrick Lamar", "url": "http://eventful.com/frankfurt/events/kendrick-lamar-/E0-001-107341882-1?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Germany", "venue": "Festhalle - Messe", "date": "2018-02-15 20:00:00"}, {"city": "Manchester", "description": " Under 14s must be accompanied by an adult. ", "title": "Kendrick Lamar", "url": "http://manchester.eventful.com/events/kendrick-lamar-/E0-001-107341719-6?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "United Kingdom", "venue": "Manchester Arena", "date": "2018-02-10 00:00:00"}], "description": "Kendrick Lamar (born Kendrick Lamar Duckworth June 17, 1987) is a rapper from Compton, California. He is also a member of the hip-hop supergroup Black Hippy collective along with members Jay Rock, Ab-Soul and Schoolboy Q. His music is largely influenced by the works of 2Pac, Jay-Z, Nas, DMX, The Notorious B.I.G., Mos Def, Eazy-E and Eminem.\n\nHe began to gain major recognition in 2010 after his first retail release, Overly Dedicated. The following year, Lamar independently released his first studio album Section.80, which included his debut single, \"HiiiPoWeR\". By that time, he had amassed a large Internet following and collaborated with several artists in the hip hop industry, including The Game, Snoop Dogg, Busta Rhymes, Lil Wayne and Drake.\n\nLamar secured a major-label record deal with Aftermath and Interscope Records, in 2012. His major-label debut, good kid, m.A.A.d city, was released in October 2012 to critical success. The record contained the top 40 singles \"Swimming Pools (Drank)\", \"Bitch, Don't Kill My Vibe\", and \"Poetic Justice\". It debuted at number two on the U.S. Billboard 200 chart and was later certified platinum by the Recording Industry Association of America (RIAA). Lamar won his first Grammy Award for \"i\", lead single from his critical acclaimed third album To Pimp a Butterfly (2015). The album drew on free jazz, funk, soul, and spoken word, debuted atop the charts in the U.S. and the UK, and won the Grammy Award for Best Rap Album at the 58th ceremony. In 2016, Lamar released untitled unmastered., a collection of unreleased demos that originated during the recording sessions for Butterfly.\n\nLamar has received a number of accolades over the course of his career, including seven Grammy Awards. In early 2013, MTV named Lamar the number one \"Hottest MC in the Game\", on their annual list. Time named Lamar one of the 100 most influential people in the world in 2016.\n\nLamar's fourth album, DAMN. was released April 17, 2017 to widespread critical acclaim. It debuted at number one on the Billboard 200, earning Lamar his third consecutive number one album in the United States. The album was supported by the lead single, \"Humble.\". \n <a href=\"https://www.last.fm/music/Kendrick+Lamar\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}, {"name": "Coldplay", "img": "https://lastfm-img2.akamaized.net/i/u/64s/df378e4cd71c45f2c51702b0a3290547.png", "play_count": "347506711", "tracks": [{"album": "A Rush of Blood to the Head", "play_count": "11444900", "name": "Clocks", "img": "https://lastfm-img2.akamaized.net/i/u/174s/3aa0fd17bc58e2a125f8008520415053.png", "tags": ["rock", "Coldplay", "alternative", "britpop", "alternative rock"], "lyrics": "The lights go out and I can't be saved\nTides that I tried to swim against\nHave brought me down upon my knees\nOh, I beg, I beg and plead, singing\n\nCome out of things unsaid\nShoot an apple off my head, and a\nTrouble that can't be named\nA tiger's waiting to be tamed, singing\n\nYou are\nYou are\n\nConfusion never stops\nClosing walls and ticking clocks, gonna\nCome back and take you home\nI could not stop that you now know, singing\n\nCome out upon my seas\nCurse missed opportunities, am I\nA part of the cure\nOr am I part of the disease? Singing\n\nYou are\nYou are\nYou are\nYou are\n\nYou are\nYou are\n\nAnd nothing else compares\nOh, nothing else compares\nAnd nothing else compares\n\nYou are\nYou are\n\nHome, home, where I wanted to go\nHome, home, where I wanted to go\nHome, home, where I wanted to go (You are)\nHome, home, where I wanted to go (You are)", "youtube": {"duration": 259, "date_published": "2011-05-27 15:42:00", "video_id": "d020hcWA_Wg", "description": "The third single from Coldplay's second album A Rush Of Blood To The Head (2005). Stream / download it now from http://smarturl.it/AROBTTHcp Video directed by Dominic Leung. Read Guy's memories..."}, "description": "\"Clocks\" emerged in conception during the late stages into the production of Coldplay's second album, A Rush of Blood to the Head. The band's vocalist, Chris Martin, came in studio late one night. A riff popped  up in Martin's mind and wrote it on the  piano. Martin presented the riff to the band's guitarist, Jonny Buckland, who then added guitar chords on the basic track.\n\nDuring the writing of \"Clocks\", the band had already made 10 songs for the album. With this, they thought it was too late for the song's inclusion in the album. So, they recorded a demo version of the track and saved it with other unfinished tracks, labeling it \"Songs for #3\"; the band considered these tracks for their third album, X&Y.\n\nAlthough the band left \"Clocks\" unfinished, a friend of Martin heard of it and convinced him to finish the track. Marked by its lyrics which speak of urgency, Martin's friend pointed out that its meaning would contradict Martin's idea of stashing the track.\n\nPersuaded by his friend, Martin assumed on further developing the track. Other band members supplemented their ideas on the main piano track; they added a bass figure and drums. The last song included in the album, Coldplay recorded the song very fast. By the time Martin recorded his vocals, a few people inside the studio felt the song \"is something special\". According to Martin, \"Clocks\" was inspired by the English rock band Muse.\n__________________________________________\nMUSIC\n__________________________________________\n\"Clocks\" is a piano rock song. Its musicscape is built around a repeating piano riff, and features a minimalist soundscape of drums and bass. It also includes synthesizers and a sparse string arrangement.\n\nThe song's lyrical themes include contrast, contradictions and urgency. Chris Martin sings of being in the state of \"helplessness ... in a dysfunctional relationship he doesn't necessarily want to escape\". The lyrics are cryptic; the ending lines of the second verse emphasize contradiction of emotion: \"Come out upon my seas/Cursed missed opportunities/Am I a part of the cure/Or am I part of the disease?\".The song's title also \"metaphorically alludes\" to its lyrics, \"pushing one to wonder about the world’s obsession with time while connecting it to the theory: make the best of it when we’re here, present and alive\".\n\nThis won the Grammy for 2003 Record Of The Year. In accepting the award, lead singer Chris Martin dedicated it to the late Johnny Cash and to US presidential candidate John Kerry, \"Who hopefully will be your president someday.\"\n\n <a href=\"http://www.last.fm/music/Coldplay/_/Clocks\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}, {"album": "Viva la Vida or Death and All His Friends", "play_count": "14972670", "name": "Viva la Vida", "img": "https://lastfm-img2.akamaized.net/i/u/174s/3aa0fd17bc58e2a125f8008520415053.png", "tags": ["Coldplay", "alternative", "rock", "alternative rock", "viva la vida"], "lyrics": "I used to rule the world\nSeas would rise when I gave the word\nNow in the morning I sleep alone\nSweep the streets I used to own\n\nI used to roll the dice\nFeel the fear in my enemy's eyes\nListen as the crowd would sing\n\"Now the old king is dead! Long live the king!\"\n\nOne minute I held the key\nNext the walls were closed on me\nAnd I discovered that my castles stand\nUpon pillars of salt and pillars of sand\n\nI hear Jerusalem bells a-ringing\nRoman Cavalry choirs are singing\nBe my mirror, my sword and shield\nMy missionaries in a foreign field\n\nFor some reason I can't explain\nOnce you'd gone there was never\nNever an honest word\nAnd that was when I ruled the world\n\nIt was the wicked and wild wind\nBlew down the doors to let me in\nShattered windows and the sound of drums\nPeople couldn't believe what I'd become\n\nRevolutionaries wait\nFor my head on a silver plate\nJust a puppet on a lonely string\nOh who would ever want to be king?\n\nI hear Jerusalem bells a-ringing\nRoman cavalry choirs are singing\nBe my mirror, my sword and shield\nMy missionaries in a foreign field\n\nFor some reason I can't explain\nI know Saint Peter won't call my name\nNever an honest word\nBut that was when I ruled the world\n\nI hear Jerusalem bells a-ringing\nRoman cavalry choirs are singing\nBe my mirror, my sword and shield\nMy missionaries in a foreign field\n\nFor some reason I can't explain\nI know Saint Peter won't call my name\nNever an honest word\nBut that was when I ruled the world", "youtube": {"duration": 243, "date_published": "2008-08-04 09:36:03", "video_id": "dvgZkm1xWPE", "description": "Taken from the album Viva La Vida Or Death And All His Friends Get A Head Full Of Dreams now: – iTunes http://cldp.ly/cpitunes – Amazon http://smarturl.it/AHFODamazon – Google Play http://sm..."}, "description": "\"Viva la Vida\" (Spanish: \"Long Live Life\") is the second, Grammy-nominated single released from the English alternative rock band Coldplay  2008 album, Viva La Vida. It was initially released only with iTunes Store pre-orders of the album on 7 May 2008, later becoming a download-only single on 25 May 2008. With over 3 million plays, the song earned the number one spot on the Last.fm Best of 2008.\n\nThe song was used in an advertising campaign for Apple's iPod and iTunes Store while Coldplay performed the song live for the first time at the 2008 MTV Movie Awards. Two versions of the music video were released, one directed by Hype Williams, and the other, an homage to the music video for Depeche Mode's Enjoy the Silence, by Anton Corbijn.\n\nUnlike the typical arrangement of Coldplay songs, in which the piano and/or guitar dominate, \"Viva la Vida\" mostly consists of a string section playing the song's upbeat riff, along with a steady bass drum beat, bass guitar, and Chris Martin's vocals.\n\nColdplay were the first British group to hit #1 on the Hot 100 for over ten years. The previous British group to top the US singles chart was the Spice Girls with Wannabe  in February 1997. (See http://www.songfacts.com/detail.php?id=11520 for plenty more trivia on \"Viva La Vida\"). The california based hip-hop/reggae band Dirtyheads cover this song.\n\nThe BBC reports (Dec 5th 2008) that Coldplay are being sued over this song by Joe Satriani for plagiarism of his tune If I Could Fly.\nhttp://news.bbc.co.uk/1/hi/entertainment/7766683.stm\n\n'Viva La Vida' is the title track from Coldplay's hugely successful fourth studio album. It shot to the top spot in the UK charts on download sales alone scoring the band their first ever UK number one single in June 2008. <a href=\"http://www.last.fm/music/Coldplay/_/Viva+la+Vida\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}, {"album": "A Rush of Blood to the Head", "play_count": "13529665", "name": "The Scientist", "img": "https://lastfm-img2.akamaized.net/i/u/174s/3aa0fd17bc58e2a125f8008520415053.png", "tags": ["Coldplay", "rock", "alternative", "britpop", "british"], "lyrics": "Come up to meet you\nTell you I'm sorry\nYou don't know how lovely you are\n\nI had to find you\nTell you I need you\nTell you I set you apart\n\nTell me your secrets\nAnd ask me your questions\nOh let's go back to the start\n\nRunning in circles\nComing up tails\nHeads on a science apart\n\nNobody said it was easy\nIt's such a shame for us to part\nNobody said it was easy\nNo one ever said it would be this hard\n\nOh take me back to the start\n\nI was just guessing\nAt numbers and figures\nPulling your puzzles apart\n\nQuestions of science\nScience and progress\nCould not speak as loud as my heart\n\nTell me you love me\nCome back and haunt me\nOh when I rush to the start\n\nRunning in circles\nChasing tails\nComing back as we are\n\nNobody said it was easy\nOh it's such a shame for us to part\nNobody said it was easy\nNo one ever said it would be so hard\n\nI'm going back to the start", "youtube": {"duration": 266, "date_published": "2011-05-27 16:20:57", "video_id": "RB-RcX5DS5A", "description": "Taken from A Rush Of Blood To The Head. http://coldplay.com/release/a-rush-of-blood-to-the-head/ ~ Follow Coldplay ~ Website: http://www.coldplay.com Twitter: https://twitter.com/coldplay..."}, "description": "Chris Martin wrote \"The Scientist\" after listening to George Harrison's \"All Things Must Pass\". In an interview with Rolling Stone, Martin revealed that while working on the band's second album, A Rush of Blood to the Head, he knew that the album was missing something. One night, during a stay in Liverpool, Martin found an old piano that was out of tune. He wanted to work on George Harrison's song \"Isn't It a Pity\", but he could not manage to do so. When the song came to Martin, he asked that the recorder be turned on. He concludes with saying that he came across this chord sequence and noted that the chord was \"lovely\". Martin recorded the vocals and piano takes in a studio in Liverpool.\n\nWhen asked about the development of the song, during a track-by-track reveal, Martin said: \"That's just about girls. It's weird that whatever else is on your mind, whether it's the downfall of global economics or terrible environmental troubles, the thing that always gets you most is when you fancy someone.\"\n\nHowever, the inside cover to A Rush of Blood to the Head stated: \"The Scientist is Dan.\" 'Dan' refers to Dan Keeling, the A&R man who signed the band to Parlophone.\n <a href=\"http://www.last.fm/music/Coldplay/_/The+Scientist\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}, {"album": "Parachutes", "play_count": "11694224", "name": "Yellow", "img": "https://lastfm-img2.akamaized.net/i/u/174s/3aa0fd17bc58e2a125f8008520415053.png", "tags": ["rock", "Coldplay", "alternative", "britpop", "alternative rock"], "lyrics": "Look at the stars\nLook how they shine for you\nAnd everything you do\nYeah, they were all yellow\n\nI came along\nI wrote a song for you\nAnd all the things you do\nAnd it was called \"Yellow\"\n\nSo, then, I took my turn\nOh, what a thing to've done\nAnd it was all yellow\n\nYour skin\nOh, yeah, your skin and bones\nTurn it into something beautiful\nD'you know\nYou know I love you so\nYou know I love you so\n\nI swam across\nI jumped across for you\nOh, what a thing to do\n'Cause you were all yellow\n\nI drew a line\nI drew a line for you\nOh, what a thing to do\nAnd it was all yellow\n\nYour skin\nOh, yeah, your skin and bones\nTurn into something beautiful\nD'you know\nFor you, I'd bleed myself dry\nFor you, I'd bleed myself dry\n\nIt's true\nLook how they shine for you\nLook how they shine for you\nLook how they shine for\nLook how they shine for you\nLook how they shine for you\nLook how they shine\n\nLook at the stars\nLook how they shine for you\nAnd all the things that you do", "youtube": {"duration": 273, "date_published": "2011-05-30 13:12:47", "video_id": "yKNxeF4KMsY", "description": "Get A Head Full Of Dreams now: – iTunes http://cldp.ly/cpitunes – Amazon http://smarturl.it/AHFODamazon – Google Play http://smarturl.it/AHFODgplay – CD (with exclusive holographic..."}, "description": "\"Yellow\" is a song by English alternative rock band Coldplay. The band wrote the song and co-produced it with British record producer Ken Nelson for their debut album, Parachutes. The song's lyrics are a reference to band vocalist Chris Martin's unrequited love, and its musicscape is built on a varied instrumentation.\n\nThe song was released in June 2000 as the second single off the album, following \"Shiver\", and the lead single in the United States. The single reached number four in the UK Singles Chart, giving the band their first top-five hit in the United Kingdom.\n\nHelped by heavy rotation and usage in promotions, the song thrust the band into massive popularity. \"Yellow\" has since been covered by various recording artists worldwide, and remains one of the band's most popular songs.\n\nWhile composing the song's lyrics, however, Chris Martin could not find the right words. He was thinking of a specific word, which he deemed a missing key word in the lyrics, to fit the song's concept. He looked around the studio and found the telephone directory Yellow Pages, which happened to be situated nearest to him. Chris Martin later titled the song \"Yellow\" as a reference to the directory. But according to him, \"In an alternate universe, this song could be called 'Playboy.'\" The lyrics progressed from there with the band collaborating. The band's bassist Guy Berryman came up with the opening line \"Look at the stars\". That night, having quickly composed the song, the band recorded it.\n <a href=\"http://www.last.fm/music/Coldplay/_/Yellow\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}, {"album": "X&Y", "play_count": "12409316", "name": "Fix You", "img": "https://lastfm-img2.akamaized.net/i/u/174s/3aa0fd17bc58e2a125f8008520415053.png", "tags": ["Coldplay", "rock", "alternative", "britpop", "alternative rock"], "lyrics": "When you try your best but you don't succeed\nWhen you get what you want but not what you need\nWhen you feel so tired but you can't sleep\nStuck in reverse\n\nAnd the tears come streaming down your face\nWhen you lose something you can't replace\nWhen you love someone but it goes to waste\nCould it be worse?\n\nLights will guide you home\nAnd ignite your bones\nAnd I will try to fix you\n\nAnd high up above or down below\nWhen you're too in love to let it go\nBut if you never try you'll never know\nJust what you're worth\n\nLights will guide you home\nAnd ignite your bones\nAnd I will try to fix you\n\nTears stream down your face\nWhen you lose something you cannot replace\nTears stream down your face\nAnd I...\n\nTears stream down your face\nI promise you I will learn from my mistakes\nTears stream down your face\nAnd I...\n\nLights will guide you home\nAnd ignite your bones\nAnd I will try to fix you", "youtube": {"duration": 296, "date_published": "2011-05-30 13:47:04", "video_id": "k4V3Mo61fJM", "description": "Get A Head Full Of Dreams now: – iTunes http://cldp.ly/cpitunes – Amazon http://smarturl.it/AHFODamazon – Google Play http://smarturl.it/AHFODgplay – CD (with exclusive holographic..."}, "description": "Fix You is the fourth track on Coldplay's third album, X&Y. The song was written by all four members of the band, and was released as the second single from X&Y.\n\nReportedly, Chris Martin wrote the song for Gwyneth Paltrow after her father's death. The organ played in the song is said to have been a gift Bruce Paltrow gave to his daughter Gwyneth some years before his death.\n\nRolling Stone, in their review for X&Y said of Fix You that \"one of the best [songs on X&Y] is 'Fix You', an unabashedly sentimental song where Martin delivers words of encouragement in a gentle falsetto, proving once more that no band can deliver a stately rock ballad like this one.\"\n\nThe music video for Fix You was directed by Sophie Muller and included footage from the band's two night stay at Reebok Stadium in Bolton. The video is now widely regarded as a tribute to the July 7th 2005 London bombings. <a href=\"http://www.last.fm/music/Coldplay/_/Fix+You\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}], "events": [{"city": "Crewe", "description": " The group performs hits from Coldplay&#39;s back catalogue.<br>", "title": "Coldplace: Coldplay Tribute", "url": "http://eventful.com/crewe/events/coldplace-coldplay-tribute-/E0-001-110404795-2?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "United Kingdom", "venue": "Crewe Lyceum Theatre", "date": "2018-03-04 00:00:00"}, {"city": "Bochum", "description": " Sonntag, 01.04.2018<br> - A TRIBUTE TO COLDPLAY -<br>Tickets für EUR 16,50 zzgl. Vvk.-Geb. (AK: EUR 20,-) an bekannten Vorverkaufsstellen und unter www.konticket.de<br>Einlass: 19:00, Beginn: 20:00<br><br>A Tribute To COLDPLAY - GOLDPLAY<br><br>Sie haben längst Kultstatus erreicht - COLDPLAY sind mit weltweit mehr als 50 Millionen verkauften Alben, etlichen Nummer-Eins-Hits und ungezählten Auszeichnungen, darunter sieben Grammies, neun Brit-Awards, vier MTV Europe Music Awards und vier Echos, unumstritten eine der größten und erfolgreichsten Bands dieses Jahrzehnts.<br><br>&quot;Goldplay Live&quot; bringt diese außergewöhnliche Erfolgsgeschichte auf die Bühne. Emotionen, Show und Musikalität gepaart mit einer Menge Leidenschaft versprechen ein erstklassiges und authentisches Konzert Erlebnis. &quot;Goldplay Live&quot; sind die Alternative für alle Coldplay Fans. Erleben Sie &quot;Goldplay Live&quot; als colourful Party Experiance oder Unplugged Show.<br><br>Chris Martin hatte ja das siebte Album der Band verglichen mit dem letzten Harry-Potter-Band und damit nicht zum ersten Mal dunkle Spekulationen um die Zukunft von Coldplay ausgelöst...<br><br>With over 50 million albums sold worldwide, seven Grammies and nine Brit awards, four MTV music awards and 4 Echoes Coldplay are one of the biggest and outstanding artists of the century. Songs like &quot;Clocks&quot;, &quot;In my place&quot;, &quot;Viva la vida&quot; or &quot;Yellow&quot; took the charts by storm and conquered the hearts of their fans all over the planet.<br><br>The tribute show Goldplay-Live sets this most exceptional performance on the scene. Emotions and musical sense come across with all passion to offer a truly first class concert, an authentic live show that remains unforgotten.<br><br><a href=\"http://www.konticket.de/Suchergebnis.html?shopsuche=Zeche%20Bochum\" rel=\"nofollow\">&gt; zum Online-Ticketshop</a><br><a href=\"http://www.coldplay-tributeband.de/\" rel=\"nofollow\">&gt; zur Homepage des Künstlers</a>", "title": "- A TRIBUTE TO COLDPLAY -", "url": "http://eventful.com/events/tribute-coldplay-/E0-001-072768033-3?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Germany", "venue": "Zeche", "date": "2018-04-01 20:00:00"}, {"city": "Bitteswell", "description": " <p><a href=\"https://www.facebook.com/The-Austrian-Stones-376438732562629/\" rel=\"nofollow\"></a></p><p>A live performance of music from Coldplay by Tribute band Ultimate Coldplay.</p><p>This Midlands based Tribute band are &apos;the next best thing&apos;. Attention to detail means these guys are a true homage to Chris Martin and the Coldplay boys. If you like the music of Coldplay you&apos;ll love listening to it Live!</p><p><br></p><p>Doors open at 7pm</p><p>The Live Music will start around 8pm, concluding between 10 and half past.</p><p>We look forward to welcoming you for another great night of Live Music.</p>", "title": "Ultimate Coldplay - A Tribute - Live band night", "url": "http://eventful.com/events/ultimate-coldplay-tribute-live-band-night-/E0-001-106788755-2?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "United Kingdom", "venue": "The Piano Rooms", "date": "2018-04-14 20:00:00"}, {"city": "Bilston", "description": " The group cover the hits of the successful commercial pop act.<br>", "title": "Ultimate Coldplay: Coldplay Tribute", "url": "http://eventful.com/events/ultimate-coldplay-coldplay-tribute-/E0-001-109649929-6?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "United Kingdom", "venue": "Robin Hood 2", "date": "2018-03-08 00:00:00"}, {"city": "York", "description": " <p> Ticket: £16.50 <a href=\"http://www.ticketweb.co.uk/event/285271\" title=\"Buy Now\" rel=\"nofollow\">Buy Now</a><br> Doors: 3.30pm<br> Age: 14+ <p>Brand new indoor all-dayer with a real festival vibe – ADOLESCENT!<p>From the release of the ‘Whatever People Say I Am, That’s What I’m Not’, the Monkeys phenomenon swept the UK. The original band played Fibbs and sold it out in 24 hrs, and <a href=\"https://www.facebook.com/antarcticmonkeys/\" rel=\"nofollow\">THE ANTARCTIC MONKEYS</a> became a tribute phenomenon in their own right, armed with a setlist of almost 30 songs, and are now booked up on tours worldwide.<p><a href=\"https://www.facebook.com/hrcptribute/\" rel=\"nofollow\">HOT RED CHILI PEPPERS </a>don’t just look and sound like the real deal but capture that ultra cool SoCal spirit. Oh, and they make any room bounce from front to back…<p>Over ten years Europe-wide touring in front of crowds up to 20,000 (plus the occasional TV appearance) should tell you how good these guys really are. Melodic rock and worldwide anthems – <a href=\"https://www.facebook.com/vivalacoldplaytribute/\" rel=\"nofollow\">VIVA LA COLDPLAY</a> – an ideal way to start of the tributes.<p>And opening up, a big welcome back to the very excellent and highly tipped in all the right places <a href=\"https://www.facebook.com/serotonesuk/\" rel=\"nofollow\">SEROTONES </a> and covers trio from Selby <a href=\"https://www.facebook.com/cambramos/\" rel=\"nofollow\">CAMBRAMOS</a>.<p>Presented by James Edwards.<p>DOORS OPEN 3.30pm!!<a href=\"http://www.fibbers.co.uk/live-events/detail/anvil/\" rel=\"nofollow\">Go to next event</a> <a href=\"http://www.fibbers.co.uk/live-events/detail/the-guns-n-roses-experience-2/\" rel=\"nofollow\">Go to previous event</a></p></p></p></p></p></p></p></p>", "title": "‘ADOLESCENT’ feat. The Antarctic Monkeys, Novana, Hot Red Chili Peppers, Viva La Coldplay, Serotones, Cambramos", "url": "http://eventful.com/york/events/adolescent-feat-antarctic-monkeys-novana-hot-red-chili-/E0-001-104969404-6?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "United Kingdom", "venue": "Fibbers", "date": "2018-02-17 00:00:00"}, {"city": "Cesena", "description": " \n", "title": "Liveplay Tributo Ai Coldplay", "url": "http://eventful.com/events/liveplay-tributo-ai-coldplay-/E0-001-108115025-0?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Italy", "venue": "Vidia rock club", "date": "2018-03-03 00:00:00"}, {"city": "Siegburg Mülldorf", "description": null, "title": "\"Goldplay\"- Coldplay Tribute Show SIEGBURG", "url": "http://eventful.com/events/goldplay-coldplay-tribute-show-siegburg-/E0-001-102931881-0?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Germany", "venue": "KUBANA im Wellness-Park Siegburg", "date": "2018-04-21 21:00:00"}, {"city": "Chesterfield", "description": null, "title": "Coldplace - A Tribute to Coldplay", "url": "http://sheffield.eventful.com/events/coldplace-tribute-coldplay-/E0-001-109295411-1?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "United Kingdom", "venue": "The Winding Wheel", "date": "2018-04-27 19:30:00"}, {"city": "Unna", "description": " \n", "title": "Goldplay Live - A Tribute To Coldplay", "url": "http://eventful.com/events/goldplay-live-tribute-coldplay-/E0-001-107341346-4?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Germany", "venue": "Kühlschiff", "date": "2019-03-30 00:00:00"}, {"city": "Müllheim", "description": null, "title": "Linkin Park und Coldplay performed by Living Theory & Goldplay", "url": "http://eventful.com/events/linkin-park-und-coldplay-performed-living-theory-goldplay-/E0-001-109726189-4?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Germany", "venue": "Markgräfler Platz", "date": "2018-07-28 19:00:00"}], "description": "Coldplay is a British alternative rock band, formed in London, United Kingdom in 1997. The band comprises vocalist and pianist Chris Martin, lead guitarist Jonny Buckland – who met each other in September 1996 at Ramsay Hall (halls of residence) at University College London - bassist Guy Berryman and drummer Will Champion.\n\nNot only have Coldplay had 7 highly successful studio album releases (all of which reached #1 on the UK album chart) - with their latest 7th studio album released on December 4, 2015 (A Head Full of Dreams) - Coldplay have also achieved great success with their singles, such as Yellow, Speed of Sound, the Grammy-winning Clocks and the US and UK #1 single Viva La Vida.\n\n\nInfluences\nColdplay's early material was often compared to that of Jeff Buckley and Radiohead, while also drawing comparisons to U2 and Travis. Since the release of the band's debut album, Parachutes (2000), Coldplay has also drawn influence from other sources, including Echo and the Bunnymen and George Harrison on A Rush of Blood to the Head (2002) and Johnny Cash and Kraftwerk for X&Y (2005).\n\nFrontman Chris Martin credits 1980s Norwegian pop band a-ha for inspiring him to form his own band.\n\nColdplay never intended to become England's favorite rock & roll sons when their signature rock melodies ruled the charts throughout 2000. The quartet yearned to mess around a bit, plucking their own acoustics for fun while attending the University College of London. All had been playing instruments since their early teens and had been influenced by the likes of Bob Dylan, the Stone Roses, Neil Young, and My Bloody Valentine.\n\nThey never imagined taking reign of the UK's ever-changing rock scene. Each member had come from a solid household of middle-class parents who encouraged music. Chris Martin, the eldest of five siblings, began playing the piano as a young child. He started playing in bands around age 15 and sought solace in the words of Tom Waits. Jonny Buckland, on the other hand, was into the heavy guitar work of Eric Clapton and Jimi Hendrix and was playing guitar by age 11. Scotland native Guy Berryman was into funk instead of indie rock, therefore leaving him to play bass. The multi-instrumentalist Champion had not planned to be a drummer until he joined Coldplay. He favored playing guitar, bass, and the tin whistle, but caught on to playing percussion when the band became official.\n\nWhen they burst onto the scene, Coldplay were heart-wrenching like Travis, passionate like Jeff Buckley, and as fresh as Oasis. They played their first gig at a festival for unsigned bands in Manchester, and the Safety EP was issued shortly thereafter. The Brothers & Sisters EP was issued by Fierce Panda and released a year later. (Both releases saw only 500 pressings.) Their sweet melodies and swooning lyrics landed Coldplay a UK deal with Parlophone in April 1999, and the five-track limited edition Blue Room EP followed that autumn. With nods from the media, the dream pop foursome was hailed as the next Travis, thanks to their simplistic acoustics and charming personas. Two more EPs, Shiver and Yellow, arrived in Spring 2000.\n\nAlbums\nThe band has released 5 albums with the latest sixth album scheduled for release in May 2014: Parachutes (2000), A Rush Of Blood To The Head (2002), X&Y (2005), Viva la Vida or Death and All His Friends (2008), Mylo Xyoto (2011) and in May 2014, Ghost Stories (2014).\n\nParachutes (2000)\nTheir full-length debut album, Parachutes, earned the band a Mercury Music Prize nomination in the UK. It saw a US release in November 2000, and a month later Yellow,  was chosen as the theme song for all promo spots for the American TV network ABC. The well-received hype surrounding Coldplay continued throughout 2001 as well; they were nominated for three Brit Awards and embarked on a sold-out ten-date tour of the US. Rumors of a split consumed most of the US tour. Martin frequently battled nasty colds and voice exhaustion, which led Coldplay to cancel a series of American dates and scrap a European tour. With all gossip aside, Coldplay resumed playing in Summer 2001 and earned additional success with second single Trouble.\n\nA Rush of Blood to the Head (2002)\nBy the autumn, they had headed into the studio for a second album. Rumour had it that it might be Coldplay's last album, since the band members felt they might not capture such brilliance again. A Rush Of Blood To The Head was released in August 2002. The CD/DVD package Live 2003 was issued a year later. Capturing the band's show at the Horden Pavilion in Sydney, Australia, it highlighted Coldplay's monumental success worldwide with A Rush Of Blood To The Head. Martin specifically earned a higher notch on the celebrity scale by marrying actress Gwyneth Paltrow in December 2003. Paltrow gave birth to the couple's first daughter, Apple Blythe Alison Martin, the following April.\n\nX&Y (2005)\nFatherhood did not stop Martin from working, as Coldplay began recording material for a third album within weeks. Previously recorded material with long-time producer Ken Nelson was scrapped early on, while producer Danton Supple (Morrissey, The Cure) joined Coldplay to complete the recording of X&Y. Speed Of Sound marked Coldplay's first single from their long-awaited third effort in Spring 2005; the album followed in June, topping the charts around the world, including America and Britain.\n\nViva la Vida or Death and All His Friends (2008)\nColdplay's fourth album Viva la Vida or Death and All His Friends was released on June 12, 2008 in the United Kingdom, with the first single Violet Hill having been previously released as a free download through their official website for a week from April 29, 2008. Viva la Vida or Death and All His Friends was produced by Brian Eno, mixed by Markus Dravs, and drew influence from the time the group spent in South America. \nThe album received lots of positive feedback for its originality in melodic acoustics and slightly less 'synth-dependent' riffs. It offered a great insight into how significantly the band's music had adapted and developed to themselves and the public.\n\nCharity duet (single) for World AIDS Day (2008)\nBarely a week before the album Viva la Vida or Death and All His Friends was released, a duet with Kylie Minogue, which was intended to be used on the album, was scrapped with the comment that 'it’s just too sexy […] also we haven’t quite finished it'. The track, Lhuna was subsequently released as a charity single to promote World AIDS Day 2008 on December 1, 2008.\n\nMylo Xyloto (2011)\nColdplay's fifth album, Mylo Xyloto, was released on October 24, 2011, with the first two tracks from the album - Every Teardrop Is A Waterfall and Paradise - were released on June 3, 2011 and September 12, 2012 respectively. The album was no.1 in over 34 countries, and has sold over 8m copies worldwide.\n\nGhost Stories (2014)\nThe band's sixth album, Ghost Stories, was officially released on May 19, 2014. Prior to the release, Coldplay made the full album available to stream via iTunes, with an animation of the album artwork designed by Mila Fürstová, one week ahead of the official release date. The first track from the album, Midnight was released on February 25, 2014. The album was recorded at The Bakery and The Beehive studios in London, England. Ghost Stories entered the Billboard 200 as Number 1 and marked Coldplay's fourth straight number 1 studio album, selling 383,000 copies in the US in the week ending May 25, 2014 - of which 64% came from digital downloads according to Billboard.\n\nA Head Full of Dreams (2015)\nThe band's 7th studio album, A Head Full of Dreams, was released December 4, 2015 on the Parlophone label. The 11-track album (with an additional hidden track called “X Marks The Spot”) was recorded in LA and London, and was produced by Stargate and Rik Simpson. A world tour is promised to accompany the album in 2016.\n\nSuper Bowl - February 2016\nColdplay headlined at the much coverted Super Bowl 50 half-time show on February 7, 2016. The band performed a remixed version of their hit single \"Yellow\", before playing \"Vida La Vida\", \"Paradise\" and their 2015 single \"Adventure Of A Lifetime\". Bruno Mars and Mark Ronson then took to the stage to perform their hit \"Uptown Funk\", before Beyoncé emerged on stage with her latest single \"Formation\".\n\n2016 - First US tour since 2012\nColdplay announced its Head Full of Dreams tour on January 28, 2016 - the first in the USA since 2012. The first concert will be held at MetLife Stadium (New York) on July 16, 2016.\n\nCommercial endorsements\nColdplay are one of very few current British music acts to achieve major success in North America. Despite their large worldwide popularity, the band has remained protective of how their music is used in the media, refusing its use for product endorsements. In the past, Coldplay had turned down multi-million dollar contracts from Gatorade, Diet Coke, and Gap, who wanted to use the songs Yellow, Trouble, and Don't Panic respectively. According to Martin, \"We wouldn't be able to live with ourselves if we sold the songs' meanings like that.\"  On the other hand, Yellow has been used to back TV trailers for \"The Simpsons\" and Viva La Vida featured on an iTunes TV advert.\n\nPolitical and social activism\nSince 2002, Coldplay have been active supporters of various social and political causes. They have been visible advocates of Oxfam's Make Trade Fair campaign and Amnesty International. The group has also performed at various charity projects such as Band Aid 20, Live 8, and the Teenage Cancer Trust.\n\n\nOfficial website: www.coldplay.com\n <a href=\"https://www.last.fm/music/Coldplay\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}, {"name": "Queen", "img": "https://lastfm-img2.akamaized.net/i/u/64s/b50e0b707940419885683b793a1e6fa2.png", "play_count": "170186689", "tracks": [{"album": "A Night at the Opera", "play_count": "8819681", "name": "Bohemian Rhapsody", "img": "https://lastfm-img2.akamaized.net/i/u/174s/2df4ead3ed1b4522b479f264a0cad22a.png", "tags": ["classic rock", "rock", "Queen", "70s", "80s"], "lyrics": "Is this the real life?\nIs this just fantasy?\nCaught in a landslide\nNo escape from reality\nOpen your eyes\nLook up to the skies and see\nI'm just a poor boy, I need no sympathy\nBecause I'm easy come, easy go\nLittle high, little low\nAnyway the wind blows, doesn't really matter to me\nTo me\n\nMama, just killed a man\nPut a gun against his head\nPulled my trigger, now he's dead\nMama, life had just begun\nBut now I've gone and thrown it all away\nMama, ooh\nDidn't mean to make you cry\nIf I'm not back again this time tomorrow\nCarry on, carry on, as if nothing really matters\n\nToo late, my time has come\nSends shivers down my spine\nBody's aching all the time\nGoodbye everybody, I've got to go\nGotta leave you all behind and face the truth\nMama, ooh (Any way the wind blows)\nI don't wanna die\nI sometimes wish I'd never been born at all\n\nI see a little silhouetto of a man\nScaramouche, Scaramouche, will you do the Fandango?\nThunderbolts and lightning, very, very frightening me\nGalileo, Galileo\nGalileo, Galileo\nGalileo, Figaro\nMagnifico (Oh, oh, oh, oh!)\nI'm just a poor boy, nobody loves me\nHe's just a poor boy from a poor family\nSpare him his life from this monstrosity\nEasy come, easy go, will you let me go?\nBismillah! No!\nWe will not let you go (Let him go!)\nBismillah! We will not let you go (Let him go!)\nBismillah! We will not let you go (Let me go!)\nWill not let you go (Let me go!) (Never, never, never, never, never let me go!)\nWill not let you go (Let me go!)\nOh, oh, oh, oh\nNo, no, no, no, no, no, no!\nOh, mamma mia, mamma mia\nMamma mia, let me go\nBeelzebub has a devil put aside for me\nFor me\nFor me!\n\nSo you think you can stone me and spit in my eye?\nSo you think you can love me and leave me to die?\nOh baby, can't do this to me baby\nJust gotta get out, just gotta get right out of here\n\nOoh\nOoh yeah, ooh yeah\n\nNothing really matters\nAnyone can see\nNothing really matters, nothing really matters to me\n\nAny way the wind blows", "youtube": {"duration": 367, "date_published": "2008-08-01 11:06:40", "video_id": "fJ9rUzIMcZQ", "description": "Subscribe to the official Queen channel Here http://bit.ly/Subscribe2Queen Taken from A Night At The Opera, 1975. Queen - 'Bohemian Rhapsody' Click here to buy the DVD with this video at..."}, "description": "\"Bohemian Rhapsody\" is a song written by Freddie Mercury and originally recorded by the band Queen for their 1975 album A Night at the Opera.\n\nThe song is in the style of a stream-of-consciousness nightmare, and has unusual musical structure for popular music (it has no chorus, instead consisting of seemingly disjointed sections including operatic segments, an a cappella and a hard rock part) which works beyond the range of this reviewer. Despite this, it was released as a single and became a huge commercial success. \n\nBohemian Rhapsody is widely hailed as Queen's \"magnum opus\", and it marked a decisive point in the band's career and set them on the way to become one of the world's most popular music groups.  The single was accompanied by a groundbreaking music video (then termed a \"promotional video\") which helped establish the visual language of the modern music video. \n\nA truncated version of the song was included in all Queen's subsequent live concert performances (as the band could not recreate the middle section live, because of the many overdubbed voices) and still enjoys great popularity around the world.\n\nIn January 1976,  Freddie Mercury was interviewed by Sounds regarding the writing process of the song.:\n\n\"I'm going to shatter some illusions, it was just one of those pieces I wrote for the album: just writing my batch of songs. In its early stages I almost rejected it, but then it grew. We started deciding on a single about halfway through. There were a few contenders - we were thinking of 'The Prophet's Song' at one point - but then 'Bohemian Rhapsody' seemed the one. There was a time when the others wanted to chop it around a bit, but I refused. If it was going to be released, it would be in its entirety. We knew it was very risky, but we had so much confidence in that song - I did anyway. I felt, underneath it all, that if it was successful it would earn a lot of respect. People were all going, You're joking, they'll never play it, you'll only hear the first few bars and then they'll fade it out. We had numerous rows. EMI were shocked - A six-minute single? You must be joking! The same in America - Oh, you just got away with it in Britain.\"\n\nIn a 1982 interview with  On The Record, Queen guitarist Brian May discussed the song's vocal harmonies, and creating the now famous solo.\n\nInterviewer: Who came up with the idea for the vocal harmonies used in \"Bohemian Rhapsody\"?\n\nBrian May:  We always were keen on that kind of thing. That was something which we wanted to do from the beginning. We wanted to be a group that could do the heaviness of hard rock, but also have harmonies swooping around all over the place. We thought there was some real power and emotion in that combination.\n\nInterviewer: Was the first solo in that song very difficult for you?\n\nBrian May: No, that was pretty much off the cuff, except I think I had plenty of time to think about that one. I remember playing along with it in the studio for a while when other things were being done. I knew what kind of melody I wanted to play. \n\nJohn Deacon spoke about the song in a 1977 interview: \"When we finished the album, the Night at the Opera album, that was the track on it that we thought we were gonna release as a single in England first. And when we released it in England we didn't necessarily think it'd be released in America, cause we know even over here, you know, the AM tastes are even more (hesitates) stricter. Anyway we did have thoughts about even in England, perhaps editing it down at all, but we listened to it over and over again and there was no way we could edit it. We tried a few ideas, but if you edited it, you always lost some part of the song, so we had to leave it all in. And luckily it took off anyway.\" <a href=\"http://www.last.fm/music/Queen/_/Bohemian+Rhapsody\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}, {"album": "Jazz", "play_count": "6997172", "name": "Don't Stop Me Now", "img": "https://lastfm-img2.akamaized.net/i/u/174s/2df4ead3ed1b4522b479f264a0cad22a.png", "tags": ["classic rock", "rock", "Queen", "70s", "80s"], "lyrics": "Tonight I'm gonna have myself a real good time\nI feel alive\n\nAnd the world I'll turn it inside out, yeah\nI'm floating around in ecstasy\nSo don't stop me now\nDon't stop me\n'Cause I'm having a good time\nHaving a good time\n\nI'm a shooting star leaping through the sky\nLike a tiger\nDefying the laws of gravity\n\nI'm a racing car passing by\nLike Lady Godiva\nI'm gonna go, go, go\nThere's no stopping me\n\nI'm burning through the sky, yeah\n200 degrees, that's why they call me Mister Fahrenheit\nI'm travelling at the speed of light\nI wanna make a supersonic man out of you\n\nDon't stop me now\nI'm having such a good time\nI'm having a ball\n\nDon't stop me now\nIf you wanna have a good time\nJust give me a call\n\nDon't stop me now\nCause I'm havin' a good time\nDon't stop me now\nYes I'm havin' a good time\nI don't wanna stop at all, yeah\n\nI'm a rocket ship on my way to Mars\nOn a collision course\nI am a satellite\nI'm out of control\n\nI'm a sax machine ready to reload like an atom bomb\nAbout to whoa, oh, oh, oh, oh, explode\n\nI'm burning through the sky, yeah\n200 degrees, that's why they call me Mister Fahrenheit\nI'm travelling at the speed of light\nI wanna make a supersonic woman of you\n\n(Don't stop me)\n(Don't stop me)\n(Don't stop me)\nHey, hey, hey\n\n(Don't stop me)\n(Don't stop me)\nOoh-ooh-ooh\nI like it!\n\n(Don't stop me)\n(Don't stop me) (Hey-hi!)\nHave a good time\nGood time\n\n(Don't stop me)\n(Don't stop me)\nAhh\nLet loose, honey!\nAll right\n\nOh, I'm burning through the sky, yeah\n200 degrees, that's why they call me Mister Fahrenheit, hey!\nTravelling at the speed of light\nI wanna make a supersonic man out of you\nYeah, yeah\n\nDon't stop me now\nI'm having such a good time\nI'm having a ball\n\nDon't stop me now\n(Woo!) If you wanna have a good time\n(All right!) Just give me a call\n\nDon't stop me now\n'Cause I'm havin' a good time\n\nDon't stop me now\nYes, I'm havin' a good time\nI don't want to stop at all\n\nHa da da da da\nDa da da\nHa da da ha ha ha\nHa da da\nHa da da da da", "youtube": {"duration": 217, "date_published": "2008-08-01 12:05:22", "video_id": "HgzGwKwLmgM", "description": "Subscribe to the Official Queen Channel Here http://bit.ly/Subscribe2Queen Taken from Jazz, 1978. Queen - 'Don't Stop Me Now' Click here to buy the DVD with this video at the Official Queen..."}, "description": "Don't Stop Me Now is a 1979 hit single by Queen, from their 1978 album Jazz. \nLyrics and music were written by lead singer Freddie Mercury. \nThe song was recorded in August/September 1978 in Nice, France.\n\nMusically, the song is based around Mercury's piano playing, with John Deacon and Roger Taylor providing a bass guitar and drums backing track. On the studio version, Brian May's only guitar playing is in his guitar solo, but on live versions performed on the band's 1978 and 1979 tours, May would also play rhythm guitar throughout the rest of the song to add a rockier feeling to it.\n\n The song also provides an example of Queen's trademark style of multi-track harmony vocals for the chorus lines. Several recordings were laid over each other to achieve the final sound.\n\nThe lyrics have cosmic imagery describing feelings of power and exhilaration, for example \"I'm gonna go, go, go there's no stopping me / I'm burning through the sky yeah 200 degrees…\".\n\nThe single reached #9 in the UK charts but only #86 in the US. \n\nDespite the fact that the studio version is one of Queen's most popular songs, it only lasted from 1978-1979 live, with the last performance in the Crazy Tour. <a href=\"http://www.last.fm/music/Queen/_/Don%27t+Stop+Me+Now\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}, {"album": "Greatest Hits", "play_count": "5497272", "name": "Another One Bites the Dust", "img": "https://lastfm-img2.akamaized.net/i/u/174s/2df4ead3ed1b4522b479f264a0cad22a.png", "tags": ["classic rock", "rock", "Queen", "80s", "glam rock"], "lyrics": "Ooh, let's go!\n\nSteve walks warily down the street\nWith the brim pulled way down low\nAin't no sound but the sound of his feet\nMachine guns ready to go\n\nAre you ready, hey, are you ready for this?\nAre you hanging on the edge of your seat?\nOut of the doorway, the bullets rip\nTo the sound of the beat, yeah\n\nAnother one bites the dust\nAnother one bites the dust\nAnd another one gone and another one gone\nAnother one bites the dust, yeah\nHey, I'm gonna get you too\nAnother one bites the dust\n\nHow do you think I'm gonna get along\nWithout you when you're gone-ah?\nYou took me for everything that I had\nAnd kicked me out on my own\n\nAre you happy? Are you satisfied?\nHow long can you stand the heat?\nOut of the doorway, the bullets rip-ah\nTo the sound of the beat, look out!\n\nAnother one bites the dust-ah\nAnother one bites the dust-ah\nAnd another one gone and another one gone\nAnother one bites the dust, hey\nHey, I'm gonna get you too\nAnother one bites the dust\n\nHey!\nAw, take it!\nBite the dust!\nBite the dust, yeah!\n\nHey-uh\nAnother one bites the dust\nAnother one bites the dust, ow!\nAnother one bites the dust, hey hey!\nAnother one bites the dust \nHey, yeah, yeah, yeah, hey\nOoh, shooter!\n\nThere are plenty of ways that you can hurt a man\nAnd bring him to the ground\nYou can beat him, you can cheat him, you can treat him bad \nAnd then leave him when he's down, yeah\n\nBut I'm ready, yes, I'm ready for you\nI'm standing on my own two feet\nOut of the doorway, the bullets rip\nRepeating to the sound of the beat\nSo, yeah\n\nAnother one bites the dust-ah\nAnother one bites the dust\nAnd another one gone and another one gone\nAnother one bites the dust, yeah\nHey, I'm gonna get you too\nAnother one bites the dust\nOh, shooter!\nAy, hey\nAll right", "youtube": {"duration": 223, "date_published": "2008-08-01 11:40:18", "video_id": "rY0WxgSXdEE", "description": "Subscribe to the Official Queen Channel Here http://bit.ly/Subscribe2Queen Taken from The Game, 1980. Queen - 'Another One Bites the Dust' Click here to buy the DVD with this video at the..."}, "description": "Queen bass player John Deacon wrote this. All 4 members of Queen wrote songs, and each wrote at least one hit. Deacon also wrote \"You’re My Best Friend”\n\nQueen recorded a live version of Another One Bites The Dust which can be heard at Another One Bites The Dust (live)\n\nDeacon was influenced by the Chic song Good Times. In an interview with the New Musical Express, Chic bass player Bernard Edwards said: “Well, that Queen record came about because that bass player spent some time hanging out with us at our studio. But that’s OK. What isn’t OK is that the press started saying that we had ripped them off! Can you believe that? ‘Good Times’ came out more than a year before, but it was inconceivable to these people that black musicians could possibly be innovative like that. It was just these dumb Disco guys ripping off this Rock ‘n’ Roll song.”\n\nDeacon played most of the instruments on the track: lead and rhythm guitars, bass, reversed piano and additional percussion. Brian May did some guitar effects with harmoniser (in the interlude), and Roger Taylor played the drum loop. Surprisingly, there are no synthesizers, despite the band's decision to use synthesizers for the first time on the album.\n\n The drum track and the hand claps were looped. They repeat throughout the song.\n\nWhile the band and producer Reinhold Mack were mixing the track, Brian May’s roadie suggested it to be released as single; the band didn’t like the idea but were finally talked into doing it when Michael Jackson, after a concert, suggested the same idea.\n\nDeacon claimed in a 1980 interview that Roger Taylor opposed the song’s drum beat. However the drummer denied this in an interview with Mojo magazine October 2008. He insisted: “I’d already had an ineffectual pop at that kind of music with ‘Fun It,’ on the Jazz album. I was never against Another One Bites The Dust, but I was against releasing it as a single.”\n\nFreddie Mercury loved this track. Brian May recalled to Mojo: “Freddie sung until his throat bled on Another One Bites The Dust. He was so into it. He wanted to make that song something special.” <a href=\"http://www.last.fm/music/Queen/_/Another+One+Bites+the+Dust\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}, {"album": "Greatest Hits", "play_count": "5174460", "name": "We Will Rock You", "img": "https://lastfm-img2.akamaized.net/i/u/174s/2df4ead3ed1b4522b479f264a0cad22a.png", "tags": ["rock", "classic rock", "Queen", "70s", "80s"], "lyrics": "Buddy, you're a boy, make a big noise\nPlayin' in the street, gonna be a big man someday\nYou got mud on your face\nYou big disgrace\nKickin' your kind all over the place\n\nSingin' \nWe will, we will rock you\nWe will, we will rock you\n\nBuddy, you're a young man, hard man\nShouting in the street, gonna take on the world some day\nYou got blood on your face\nYou big disgrace\nWaving your banner all over the place\n\nWe will, we will rock you (Sing it, ah)\nWe will, we will rock you\n\nBuddy, you're an old man, poor man\nPleading with your eyes, gonna make you some peace some day\nYou got mud on your face\nBig disgrace\nSomebody better put you back into your place\n\nWe will, we will rock you\nSing it!\nHmm, we will, we will rock you\nEverybody, we will, we will rock you \nUh, we will, we will rock you \nAlright", "youtube": {"duration": 135, "date_published": "2008-08-01 23:47:47", "video_id": "-tJYN-eG1zk", "description": "Subscribe to the Official Queen Channel Here http://bit.ly/Subscribe2Queen Taken from News Of The World, 1977. Queen - 'We Will Rock You' Click here to buy the DVD with this video at the..."}, "description": "\"We Will Rock You\" is a song written by Brian May and recorded and performed by Queen as the opening track on their 1977 album News of the World. The album version consists of a stamping-clapping beat, and a power chorus, being somewhat of an anthem. The stamping effects were created by the band overdubbing the sounds of themselves stomping and clapping many times and adding delay effects to create a sound like many people were participating. According to the We Will Rock You Songfacts, Brian May said that his degree in astrophysics helped in the recording of the crucial 'stomp-stomp-clap!\" rhythm of the song. Other than the last 30 seconds containing a guitar solo, the song is generally set in acapella form, using  clapping as a rhythmic beat.\n\nAs the double A-side with \"We Are The Champions\", \"We Will Rock You\" reached number 4 on the U.S. Billboard singles chart, becoming their second hit in the U.S. On the 45 of the song's original vinyl record release, the song was actually the flip side of \"We Are the Champions\" in Britain, however the American record company requested to put the two songs together as a \"double A-side\" because American radio stations were playing them back to back. This is a reason why the songs are often paired on the radio and at sporting events, where they are frequently played. The songs are also paired back to back on the album, and they are still played together to this day on American classic rock radio stations.\n\nQueen also performed the song in another arrangement (known as the \"fast version\"), which featured a faster tempo and a full guitar, bass and drums backing track throughout. The band would often open their live sets in the late 1970s and early 1980s with this version, as captured on their 1979 Live Killers double album, on Queen Rock Montreal (2007), and on the Queen on Fire - Live at the Bowl album released in 2004.\nThe \"stomp, stomp, clap\" sounds were later reused in the Queen + Paul Rodgers song \"Still Burnin'\", a composition which was also written by May.\n\n\"We Will Rock You,\" as recalled by May in a 2002 interview with Guitar World magazine, \"was a response to a particular phase in Queen's career, when the audience was becoming a bigger part of the show than we were. They would sing all the songs. And in a place like Birmingham, they'd be so vociferous that we'd have to stop the show and let them sing to us. So, both Freddie and I thought it would be an interesting experiment to write a song with audience participation specifically in mind. My feeling was that everyone can stamp and clap and sing a simple motif, so We Will Rock You was based on that. \n\n\"We recorded it at [Basing Street] Wessex, which is an old converted church that has a natural good sound to it. There are no drums on the track. It's just us clapping and stamping on boards, overdubbed many times over with many primitive delay machines. A bit of singing, a bit of guitar playing, and that's it. The amazing thing is to go to football [soccer] matches or sports events in general and hear people do it. It's very gratifying to find that it has become part of folklore, sort of. I'll die happy because of that.\" \n\nIn a recent interview with Terry Gross (host of \"Fresh Air\"), conducted on August 3rd 2010, May was asked to elaborate on writing the song.\n\nTerry Gross: \" So what inspired that song? I mean, it's been played at so many sports stadiums over the decades. What were you thinking about when you wrote it? Were you thinking of it as a sports anthem?\"\n\nBrian May: No, not really. I was thinking of it more as a rock anthem, I suppose, and a means of uniting an audience or taking advantage, you know, enjoying the fact that an audience is united. And I didn't realize that it would transfer to sports games and this is quite an amazing thing. It's wonderful for me to see what \"We Will Rock You\" has done. You know, \"We Will Rock You\" and \"We Are the Champions,\" of course, have kind of transcended the normal framework of where music is listened to and appreciated. They've become part of public life, which I feel wonderful about. It's fantastic to me if I go to a, you know, a football game or a soccer game or basketball or whatever or any place all around the world, and there it is. And I think, \"My God. Most people don't even realize that I wrote it. Most people don't realize that it was written\". \"\n\nGross: That's right.\n\nMay:: It's sort of become …\n\nGross:: (laughs)  That’s right.\n\nMay: …one of those things that people think was always there. You know, it sort of goes back into pre-history. So in a way, that's the best compliment you could have for a song.\n\nGross:: Well, I think, you know, that's if people don't even realize it was written, it's in part because it almost sounds like an old-school cheerleader cheer, you know, because...\n\nMay: Yeah. It's become part of the fabric of life.\n\nGross:: ... of that stomp-stomp-clap thing and because it's a chant.\n\nMay: Yeah, that's right. Well, the stomp-stomp-clap thing, yeah, people think it was always there, but actually it wasn't. And I don't know how it got into my head. All I can tell you is we played a gig sort of the middle of our career in a place called Bingley Hall near Birmingham. Now, Birmingham is the sort of home of heavy metal, as you probably know. You know, Sabbath and Slade and people come from there. And it was a great night. People were just, the audience were just responding hugely, and they were singing along with everything we did. Now, in the beginning, we didn't relate to that. We were the kind of band who liked to be listened to and taken seriously and all that stuff, you know. So people singing along wasn't part of our agenda. Having said that and then having experienced this wave of participation of the audience, particularly in that gig in Birmingham, we almost to a man sort of reassessed our situation.\n\nI remember talking to Freddie about it and saying, “Look, you know, obviously, we can no longer fight this. This has to become something which is part of our show, and we have to embrace it, the fact that people want to participate. And really, everything becomes a two-way process now.” And we sort of looked at each other and went, “Hmm, how interesting”. And he went away that night and to the best of my knowledge wrote \"We Are the Champions\" with that in mind. I went away and woke up the next morning with this... (Vocalises 'stomp-stomp-clap') ... in my mind somehow because I was thinking to myself, \"What could you give an audience that they could do while they're standing there and they're all crushed together? They can stamp, and they can clap, and they can sing some kind of chant.\" So for some reason, it just came straight into my head, the \"We Will Rock You.\"\n\nAnd to me, it was kind of a uniting thing. It was an expression of strength. And the words came out very quickly. In fact, everything came out very quickly, and I think that's a good sign when you're writing a song. It should happen quickly, very often, and that means the flow is a good one. And the words are something completely different. If you ask me what I was thinking of in the words of the verses, it's something different. It's although it's related.\n\nGross:: About the boy who's told he's no good?\n\nMay: Yeah, it's about the development of a boy into a man and his dreams and how he sees himself and how he views his power in the world. It's a kind, it's sort of a contemplative song, really, although it's a big chant with fist in the air. It's about balancing your power with acceptance, I think.\n\nGross: So how did you record the stomp-stomp-clap so it would sound grand and reverberating, as opposed to three people, four people stomping their feet and clapping?\n\nMay: Well, I'm a physicist, you see. (LAUGHING) So I had this idea, if we did it enough times, and we didn't use any reverb or anything, that I could build a sound which would work.\n\nWe were very lucky. We were working in an old, disused church in North London, and it already had a nice sound, not an echoey sound but a nice, big, crisp sound to it. And there were some old boards lying around. I don't know what they were, but they just seemed ideal to stamp on. So we kind of piled them up and started stamping. And they sounded great anyway.\n\nBut being a physicist, I thought,\"Well, supposing there were a thousand people doing this, what would be happening?\" And I thought, \"Well, you would be hearing them stamping. You would also be hearing a little bit of an effect, which is due to the distance that they are from you.\" So I put lots of individual repeats on them, not an echo but a single repeat and at varying distances. And the distances were all prime numbers.\n\nNow, much later on, people designed a machine to do this, and I think it was called Prime Time or something, but that's what we did. As we recorded each track, we put a delay of a certain length on it, and none of the delays were sort of harmonically related. So what you get is there's no echo on it whatsoever, but the claps sound as though they're spread around the stereo, but they're also kind of spread as regards distance from you. So you just feel like you're in the middle of a large number of people stamping on boards and clapping …\n\nGross: That's amazing.\n\nMay: … and also singing.\n\nTS: Now, here's another really interesting thing to me about \"We Will Rock You.\" It's the most famous song that you've written. It's a largely a cappella song. You come in for your guitar solo at the very end. So until, like, the very, very end, like you're not even playing on it, and it's just kind of amazing that you as the guitarist would write a song that you're barely featured on.\n\nMay: Well, I'm featured stamping and clapping.\n\nGross:  Well, yes.\n\nMay: And I'm featured singing, so...\n\nGross: And you're very good at that.\n\n(LAUGHING)\n\nMay:: Thank you, yeah. Well, we're all featured, yeah. Yeah, well, you see, songs aren't about guitars to me. Songs are about, truthfully, a song is about a singer in my opinion, and if the singer gets the idea across, then you're almost home and dry.\n\nYou know, you can make the most beautiful piece of production, and I love production. You know, production is a big part of my life. But I'm always aware that if you don't have the right singer, and he doesn't have the right feeling, that you're wasting your time. So a song is a song to me, and it doesn't matter what song. It could be a piano accordion on it. You know, if it's the right song and the right singer, and you feel passion, that's what it's about.\n\nThe guitars, yeah, I didn't want us to be standard. I didn't want it to be like oh, here's a guitar solo, and then we sing another verse. I wanted it to be something stark and different. So it was very deliberate that I left the guitar solo to the end just because that was a final statement and a different statement, taking it off in a completely different direction. It changes key into that piece, too, you know, so it's a whole different kind of ship? (unintelligible) It was not a standard pop song. \n\n(From here, the host played the remainder of the song)\n\nGross: So that's the end of \"We Will Rock You,\" written by my guest, guitarist and singer and songwriter, Brian May, who was one of the founding members of Queen. So ...\n\nMay: I should, can I comment on the end of that?\n\nGross: Yeah, please.\n\n(LAUGHING)\n\nMay: Interesting that you play the end of the song. You can hear the guitar waiting in the wings. That was, you can hear this little feedback note. And so the guitar is present, although it's not taking center stage, all through the last choruses, and then finally, it bursts upon the scene. And you notice, Freddie goes “All right”, which means he's kind of handing over to the guitar, and we're in a different universe once the guitar starts, and that was the intention. And it's very sort of informal.\n\nAnd you may notice - there's a lot of things to notice. You may notice that the last piece, the very last little riffs, are repeated, and they're not just repeated by me playing them again. They're repeated by cutting the tape and splicing it on again and again. So, and that's deliberate, too. It's a way of getting a sort of a thing that makes you sit up towards the end. And then it stops. There is nothing after it, which I really enjoy. (laughs)\n\nThere's no big ending. It just stops and leaves you in mid-air, thinking, “Well, what happened there?”  <a href=\"http://www.last.fm/music/Queen/_/We+Will+Rock+You\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}, {"album": "Greatest Hits", "play_count": "4280345", "name": "We Are the Champions", "img": "https://lastfm-img2.akamaized.net/i/u/174s/2df4ead3ed1b4522b479f264a0cad22a.png", "tags": ["classic rock", "rock", "Queen", "70s", "80s"], "lyrics": "I've paid my dues\nTime after time\nI've done my sentence\nBut committed no crime\n\nAnd bad mistakes\nI've made a few\nI've had my share of sand kicked in my face\nBut I've come through\n(And I mean to go on and on and on)\n\nWe are the champions, my friends\nAnd we'll keep on fighting 'till the end\nWe are the champions\nWe are the champions\nNo time for losers\n'Cause we are the champions\nOf the world\n\nI've taken my bows\nAnd my curtain calls\nYou brought me fame and fortune and everything that goes with it\nI thank you all\n\nBut it's been no bed of roses\nNo pleasure cruise\nI consider it a challenge before the whole human race\nAnd I ain't gonna lose, ah\n(And I mean to go on and on and on)\n\nWe are the champions, my friends\nAnd we'll keep on fighting 'till the end\nWe are the champions\nWe are the champions\nNo time for losers\n'Cause we are the champions\nOf the world\n\nWe are the champions, my friends\nAnd we'll keep on fighting 'till the end\nWe are the champions\nWe are the champions\nNo time for losers\n'Cause we are the champions", "youtube": {"duration": 191, "date_published": "2008-08-01 12:26:25", "video_id": "04854XqcfCY", "description": "Subscribe to the Official Queen Channel Here http://bit.ly/Subscribe2Queen Taken from News Of The World, 1977. Queen - 'We Are The Champions' Click here to buy the DVD with this video at..."}, "description": "\"We Are the Champions\" is a power ballad written by Freddie Mercury, recorded and performed by Queen for their 1977 album News of the World. One of their most famous and popular songs, it has since become an anthem for sporting victories and has been often used or referenced in popular culture (see below). The song reached #2 in the UK charts and #4 on the Hot 100 in the US in 1978.\n\nMusically, it is based around Mercury's piano part, with Roger Taylor and John Deacon providing a drums and bass guitar backing. Brian May overdubbed some guitar sections, initially subtle, but building to a 'solo' played simultaneously with the last chorus. Mercury employed many jazz chords (major and minor 6th, 7th, 9th, 11th and 13th harmonies), and the choruses featured these voiced as 4 and 5-part vocal harmonies. The lead vocal is very demanding and strident, and in live performances, Mercury often deferred to let Taylor handle the highest parts of the melody.\n\nThe single featured \"We Will Rock You\" as a B-side in the UK and as a double A side in the US and other countries, and preceded the song on the album. The two songs were often played consecutively at the close of Queen concerts, and are customarily played together on radio broadcasts (in album order). Keeping with tradition, it was also used to close the 1992 Freddie Mercury Tribute Concert with all the show's acts joining in behind the lead vocal of Liza Minnelli. <a href=\"http://www.last.fm/music/Queen/_/We+Are+the+Champions\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}], "events": [{"city": "Glasgow", "description": " The Queen Extravaganza has announced a UK tour throughout October and November 2018, performing their Greatest Hits. Catch them live by checking out the tour dates and ticket information below on Stereoboard.<br>", "title": "The Queen Extravaganza", "url": "http://glasgow.eventful.com/events/queen-extravaganza-/E0-001-109870696-9?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "United Kingdom", "venue": "The SSE Hydro", "date": "2018-11-01 00:00:00"}, {"city": "Perth", "description": "Queen will be at Perth Arena! Look forward to Queen and this fantastic concert. Don´t miss the opportunity to see Queen live and buy your tickets before they are sold out. Find all of your Queen + Adam Lambert Perth tickets here on StubHub!", "title": "Queen + Adam Lambert Perth", "url": "http://perth.eventful.com/events/queen-adam-lambert-perth-/E0-001-103985965-3?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Australia", "venue": "Perth Arena", "date": "2018-03-06 20:15:00"}, {"city": "Adelaide", "description": "Queen is coming to a town near you! Yes that&#39;s right, you can see Queen live at Adelaide Entertainment Centre. Queen will be performing all the lastest tracks from the newest album. Don&#39;t miss out and buy your ticket to see Queen + Adam Lambert Adelaide today! Here at StubHub we have the best concert tickets for all your favourite artists.", "title": "Queen + Adam Lambert Adelaide", "url": "http://adelaide.eventful.com/events/queen-adam-lambert-adelaide-/E0-001-104022433-0?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Australia", "venue": "Adelaide Entertainment Centre", "date": "2018-02-28 20:15:00"}, {"city": "Melbourne", "description": "Queen is coming to a town near you!! Don&#39;t miss out on this fantastic opportunity to see Queen live. Queen will be performing the latest tracks in the charts. Buy your tickets to see Queen at StubHub. Here we have all your favourite artists, so you don&#39;t have to miss out!", "title": "Queen + Adam Lambert Melbourne", "url": "http://melbourne.eventful.com/events/queen-adam-lambert-melbourne-/E0-001-104022434-9?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "Australia", "venue": "Rod Laver Arena", "date": "2018-03-03 20:15:00"}, {"city": "Newcastle upon Tyne", "description": " Under 14s must be accompanied by an adult. ", "title": "The Queen Extravaganza", "url": "http://newcastleupontyne.eventful.com/events/queen-extravaganza-/E0-001-109697440-5?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "United Kingdom", "venue": "Newcastle City Hall", "date": "2018-11-03 00:00:00"}, {"city": "Liverpool", "description": " Under 14s must be accompanied by an adult. ", "title": "The Queen Extravaganza", "url": "http://liverpool.eventful.com/events/queen-extravaganza-/E0-001-109697441-4?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "United Kingdom", "venue": "Liverpool Philharmonic Hall", "date": "2018-11-05 20:00:00"}, {"city": "Southend-on-Sea", "description": " Under 14s must be accompanied by an adult. ", "title": "The Queen Extravaganza", "url": "http://eventful.com/southendonsea/events/queen-extravaganza-/E0-001-109697447-8?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "United Kingdom", "venue": "Cliffs Pavilion", "date": "2018-11-13 00:00:00"}, {"city": "Birmingham", "description": " Under 14s must be accompanied by an adult. ", "title": "The Queen Extravaganza", "url": "http://eventful.com/events/queen-extravaganza-/E0-001-109697450-2?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "United Kingdom", "venue": "Symphony Hall Birmingham", "date": "2018-11-19 00:00:00"}, {"city": "Leicester", "description": null, "title": "The Queen Extravaganza", "url": "http://eventful.com/leicester/events/queen-extravaganza-/E0-001-109824629-0?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "United Kingdom", "venue": "De Montfort Hall", "date": "2018-11-21 20:00:00"}, {"city": "Edinburgh", "description": " <strong>Customers have to be over 14 years of age to attend this event.</strong> Under 16s must be accompanied by an adult. ", "title": "The Queen Extravaganza", "url": "http://edinburgh.eventful.com/events/queen-extravaganza-/E0-001-109697438-0?utm_source=apis&utm_medium=apim&utm_campaign=apic", "country": "United Kingdom", "venue": "Usher Hall", "date": "2018-10-30 00:00:00"}], "description": "Queen were an English rock band originally consisting of four members: vocalist Freddie Mercury, guitarist Brian May, bass guitarist John Deacon, and drummer Roger Taylor.\n\nThe band formed in London in 1970 after May and Taylor's former band Smile split after having released an album and single. Freddie replaced lead vocalist Tim Staffell, after the latter's departure from the original trio. \n\nThere was much deliberation as to what the band's name would be. May and Taylor had settled upon the Grand Dance, derived from a C.S. Lewis Trilogy of books Out Of The Silent Planet.\n\nUltimately, the band went with Queen, a name that was entirely Freddie's. Originally Roger and, especially, Brian did not like the name, though Mercury would eventually persuade them both that it was \"right\" for the band.\n\n\"Years ago I thought up the name Queen... It's just a name, but it's very regal, and it sounds splendid. It's a strong name, very universal and immediate. It had a lot of visual potential and was open to all sorts of interpretations. I was certainly aware of the gay connotations, but that was just one facet of it. \"\n- Freddie Mercury.\n\nQueen went through several bass players before  a young electronics major by the name of John Deacon arrived on the scene in January of 1971. \n\n\"Until John, it had been exploding bass player syndrome. If they musically worked they'd look all wrong, and if they felt all right they couldn't play. - Brian May.\n\nThis quite shy guy turned up with his immaculate Rickenbacker bass and immaculate amplifier, plugged in, and as soon as he started playing we realized it was right.\" - Brian May.\n\nLater that year, the band was secured recording time at the newly built De Lane Lea studio, and used the opportunity to record several songs that would later appear on their debut album - Liar, Keep Yourself Alive, Jesus, and The Night Comes Down.  The demo reel was passed around from producer to producer with little success, until a staff member of Trident records by the name of Roy Thomas Baker was introduced to the band by fellow Trident producer John Anthony. Baker dropped in to watch the band at work and, clearly liking what he heard, recommended Queen to his superiors. \n\nIt was eventually agreed upon that the fledgling band could record at Trident studios, though after already-established artists had finished their work, such as the likes of Elton John and David Bowie. Relegated to the wee hours of the morning to record the remaining tracks of their first album, the band nonetheless stuck it out until they reached their ultimate goal of \"perfection\".\n\nQueen's self-titled debut album was released in 1973 and received little attention from the general public. They quickly followed it a year later with a second album, \"Queen II\" which also failed to generate much interest from music fans in Britain, despite the success of the album's single, Seven Seas of Rhye, which would reach #10 on the charts after the band's mimed appearance on Top of the Pops. \n\nThe band's second album was recorded with a higher budget than the first, and the band threw everything they had into recording it. Queen II was somewhat of a \"concept album\", split into \"White Side\" vs. \"Black Side\". \n\nAs was in their nature, the band pressed onward after the mediocre success of their first two albums, immersing themselves in a world-wide tour to promote Queen II. Queen played in America for the first time, as a support act for Mott the Hoople.\n\nSheer Heart Attack would be released later that year, focusing more on being accessible to listeners, than the grand and complex ideas of the previous two albums. The recording of their third album was met with some hardships, as May fell victim to a series of illnesses brought on by an infected inoculation, required for the band's rigorous touring schedule. \n\nSheer Heart Attack brought even more success for the band, with May's Now I'm Here and the song that would be the band's \"turning point\", the Mercury-penned Killer Queen, the latter of which would reach #2 on the UK charts.\n\nDuring this time, the band began developing a huge following in Japan and witnessed their popularity for themselves when they visited the country, mainly in 1975, to promote their fourth and most famous album \"A Night At The Opera\", featuring the epic \"Bohemian Rhapsody\".\n\nQueen's popularity grew steadily through the latter half of the 70s as they released hit album after hit album, reaching its peak in the mid-80s after their \"Live Aid\" appearance, and continuing into the early 90s before Mercury's untimely death on 24th November 1991. The official cause of death was bronchial pneumonia resulting from AIDS.\n\nOver the course of their 30 year career, the band did sound tracks for two films (\"Flash Gordon\" and \"Highlander\"), released a string of live and studio albums, and had many many fans across the world.\n\nIn 1995, 4 years after Mercury's death, the band released the album \"Made In Heaven\". This album saw the surviving band members in the studio completing or reworking unused vocals, unreleased variations of Freddie solo material (a Queen version of \"I Was Born To Love You\" for example), and tracks where Brian and Roger added lyrics to flesh out a song (\"Mother Love\"). \n\nQueen have been on indefinite hiatus since 1997, when John Deacon decided to retire.\n\n\nSeveral \"Queen + ...\" projects have been developed in the following years, a few of them mere remixes with no artistic involvement from the band. In 1999, a \"Greatest Hits III\" album was released. This featured, among others, \"Queen + Wyclef Jean\" on a rap version of \"Another One Bites the Dust\", a live version of \"Somebody to Love\" performed by George Michael, and a live version of \"The Show Must Go On\" performed live in 1997 with Elton John.\n\nBrian May and Roger Taylor have performed together as Queen on several occasions (award ceremonies, charity concerts, and the like), sharing vocals with various guest singers. They have also recorded several covers of Queen's hits with guest vocalists, including \"We Will Rock You\" (first with Five and later Britney Spears, Beyonce, John Farnham and P!nk) and \"We Are the Champions\" (with Robbie Williams).\n\nOn the 14th of May 2002 the Queen musical 'We Will Rock You'  opened in the Dominion theatre in London's 'West End'. A Musical about young people in the distant future who aren't allowed to listen to music not generated by computers. Various Queen songs are used in the story, played by a live band. This live band was supported by Brian May and Roger Taylor on the premiere evening.\n\nAt the end of 2004, May and Taylor announced that they would reunite and return to touring in 2005, with Paul Rodgers (founder and former lead singer of Free and Bad Company). Brian May's website also stated that Rodgers would be 'featured with' Queen as 'Queen + Paul Rodgers', not replacing Mercury. The retired John Deacon would not be participating.\n\nBetween 2005 and 2006 Queen + Paul Rodgers embarked on a world tour, the first leg in Europe and the second, Japan and then the US in 2006. On 15 August 2006, Brian May confirmed through his website and fan club that Queen + Paul Rodgers would begin producing their first studio album beginning in October, to be recorded at a \"secret location\". The album, titled The Cosmos Rocks, was released in Europe on 12 September 2008 and in the United States on 28 October 2008. Following the album the band again embarked on a tour through Europe, opening on Kharkiv's Freedom Square in front of 350,000 Ukrainian fans. The show in Ukraine was later released on DVD.\n\nQueen and Paul Rodgers officially split up without animosity on 12 May 2009. Rodgers did not rule out the possibility of working together again.\n\nMore information about Queen + Paul Rodgers can be found on their last.fm page.\n\nOfficial website: www.queenonline.com\n\nDiscography:\n1.- Queen (1973)\n2.- Queen II (1974)\n3.- Sheer Heart Attack (1974)\n4.- A Night at the Opera (1975)\n5.- A Day at the Races (1976)\n6.- News of the World (1977)\n7.- Jazz (1978)\n8.- The Game (1980)\n9.- Flash Gordon (1980)\n10.- Hot Space (1982)\n11.- The Works (1984)\n12.- A Kind of Magic (1986)\n13.- The Miracle (1989)\n14.- Innuendo (1991)\n15.- Made in Heaven (1995)\n <a href=\"https://www.last.fm/music/Queen\">Read more on Last.fm</a>. User-contributed text is available under the Creative Commons By-SA License; additional terms may apply."}]}
